{"name":"Empath","expansion":"Cosmic Conflict","color":"Green","short_desc":"May Change Attack to Negotiate","game_setup":null,"description":"You have the power of Harmony. As a main player, after either main player reveals any negotiate card and the other main player reveals an attack card, you may use this power to change the revealed attack card into a regular negotiate card. You and the other main player then attempt to make a deal.","player":"Main Player Only","mandatory":false,"phases":["Reveal"],"lore":"Eons of overpopulation forced the highly social Empaths to cooperate in order to survive. On their lush, tropical planet, they learned the value of defense and yielding. Now, they are striving to teach harmony to all other Cosmic life forms.","wild":{"description":"You may play this flare when you attempt to make a deal. If you successfully make a deal, you and the other player in the deal each receive three rewards.","player":"Main Player Only","phase":"Any Phase"},"super_flare":{"description":"As a main player or ally, if the opposing main player reveals a negotiate card, you may exchange it for an attack card from your hand. Conclude the encounter as if he or she revealed that attack card.","player":"Main Player or Ally Only","phase":"Reveal"},"retooled_gameplay":"Eon's Empath was mandatory and worked only when its owner was the player who revealed the Compromise card; that version was often disparaged as an alleged \"subset\" of Pacifist. Some rightly argued that Empath was valuable in its own right since it could earn its owner a new colony when on defense (which Pacifist cannot do), but Pacifist was clearly preferred and certainly the stronger of the two overall. FFG's choice to adopt Huckaby's revised version considerably strengthens Empath and further differentiates it from Pacifist; two welcome improvements. (See negotiate cards.) The classic edition flare matches Eon gameplay; the standard edition Wild flare is a new effect designed by FFG.","edits":"Edited to clarify that the first use of \"negotiate\" includes Crooked Deals while the second use excludes them, and to keep Masochist from abusing Classic Wild Empath for an immediate win.","tips":null,"classic_flare":{"wild":{"description":"As a main player, for the rest of this encounter, you may remove one ship from any colony (your choice) to the warp from each other player who does not say \"Sir\" or \"Ma'am\" (whichever is appropriate) each time he or she speaks.","player":"Main Player Only","phase":"Any Phase"},"super_flare":{"description":"As a main player or ally, if the opposing main player reveals a negotiate card, you may exchange it for an attack card from your hand. Conclude the encounter as if he or she revealed that attack card.","player":"Main Player or Ally Only","phase":"Reveal"}}}