{"name":"Leviathan","expansion":"Cosmic Incursion","color":"Yellow","short_desc":"May Attack with Planet","game_setup":null,"description":"You have the power of Worldships. As the offense, after the hyperspace gate is aimed, instead of placing ships in the gate normally you may use this power to choose one of your home planets that has no other players' ships on it and place that planet on the gate as a worldship. Any ships you have on the worldship are normal offensive ships in the encounter. The worldship is not a ship but adds 20 to your total after encounter cards are revealed. If you lose the encounter, all ships on the worldship are sent to the warp. If you win, you may leave up to four of your ships from the worldship behind on the targeted planet. In any case, the worldship then returns to your home system with any ships that are still on it.","player":"Offense Only","mandatory":false,"phases":["Launch"],"lore":"Immense and powerful creatures, the Leviathans consumed every resource on their own worlds until they themselves became like planets. The Leviathan fleets, now stationed within the fleshy folds of their masters, scout out new worlds for the Leviathans to envelop. The sight of a world-sized entity gating in through hyperspace often causes madness and hysteria on the targeted planet, but it doesn't last long.","wild":{"description":"As the offense, after destiny is drawn, you may trade one home planet with the defense. Your planet moves to the defense's home system and vice versa. The encounter immediately ends successfully. Give this flare to the Leviathan after use (or discard it, if the Leviathan isn't playing).","player":"Offense Only","phase":"Destiny"},"super_flare":{"description":"Your worldship may contain any ships except the defense's ships. Other players' ships on your worldship count toward your total and those players are automatically allied with you for this encounter, but they may not send additional ships and do not receive a colony if you win.","player":"Offense Only","phase":"Launch"},"retooled_gameplay":null,"edits":"Edited to implement the designer's intent that the worldship is sent instead of launching ships normally, to correct Wild Leviathan's prerequisite icon, to fix the attack bug and the launch bug, and to define what happens to the worldship (and the ships on it) if there is a deal, a failure to deal, or a canceled encounter. Although players could reasonably be expected to return the planet home, the status of the ships on that planet (whether they remain, are lost to the warp, or are allowed to migrate to the targeted planet) is undefined in those situations.","tips":null,"classic_flare":null}