{"name":"Tyrant","expansion":"Cosmic Storm","color":"Red","short_desc":"Claims Other Players' Ships","game_setup":null,"description":"You have the power to Subjugate. As a main player, when you win an encounter after revealing an attack card, use this power to subjugate one involved ship from each player on the losing side. Subjugated ships are captured and placed on this sheet instead of being sent to the warp.\nWhen you are determined to be the defense against a player whose ships you have subjugated, use this power to force that player to discard one card at random for each of his or her subjugated ships.\nWhen you are the offense and having an encounter with a player whose ships you have subjugated, after you reveal an attack card, use this power to add the number of that player's subjugated ships to your total.\nWhen you would be forced to send ships to the warp, you may choose to send subjugated ships to the warp instead. You may choose to release subjugated ships as part of a deal. When a ship is removed from this sheet, it is no longer subjugated.","player":"Main Player Only","mandatory":true,"phases":["Destiny","Reveal"],"lore":"It is no surprise that upon the arrival of the Tyrant into a new sector of space, other races begin to suddenly make travel plans to distant regions. The Tyrants are one of the most despised races in the Cosmos given their brutal leadership style, which often ends in their victims' indentured servitude.","wild":{"description":"As an ally, at the end of the encounter, you may take one card at random from the hand of each other player who sent one or more ships to the warp during the resolution phase.","player":"Ally Only","phase":"Resolution"},"super_flare":{"description":"During your regroup phase, you may subjugate one ship from the warp belonging to each player with ships in the warp and place those ships on your sheet.","player":"Offense Only","phase":"Regroup"},"retooled_gameplay":null,"edits":"Edited to eliminate the redundant rule restatement that will someday create a problem for an alien power that doesn't actually require an encounter card to proceed (i.e., Doppelganger).","tips":null,"classic_flare":null}