{"name":"Cloak","expansion":"Cosmic Eons","color":"Red","short_desc":"Makes Secret Changes","game_setup":null,"description":"You have the power to Act Unseen. Whenever both sides in an encounter reveal attack cards and the total of those cards is 20 or more, you may use this power immediately. All players must fan out their hands facedown on the table and then the other players immediately close their eyes and turn away from the table while you count out 15 seconds aloud. During this time you may move one ship, one card, both, or neither. If moving a ship, it must be from a planet to another planet or the warp, or from the warp to a planet. If moving a card, it must be from one player's hand (without peeking) to another or to the top of the appropriate discard pile, or from the top of a discard pile to a player's hand. As a diversion, you may slightly shift other ships and cards without changing their location.\nAfter the first 15 seconds are up, count out another 15 seconds while the other players look for the changes you made. They may not touch their cards or discuss, gesture, or communicate with each other in any way. Before time runs out, any one of those players, on a first-come, first-served basis, may claim that you moved one ship, one card, both, or neither, and must identify either the source or destination for each move. If that player is completely correct, he or she may either undo any or all changes or receive one reward. If the player is incorrect or no claim is made before time runs out, no changes are undone and you receive one reward.","player":"As Any Player","mandatory":false,"phases":["Reveal"],"lore":"Tired of simplistic shoplifting and bored with petty voyeurism, the Cloaks now venture forth draped in interstellar gauze, tweaking this and adjusting that.","wild":{"description":"As a main player or ally, during the planning phase, you may force each player (including yourself) to simultaneously pass one card from his or her hand to the player on his or her left. Any player who has no cards in hand must pass the card received along to the next player, but may peek at it first.","player":"Main Player or Ally Only","phase":"Planning"},"super_flare":{"description":"You may use your power if both sides reveal negotiate cards.","player":"As Any Player","phase":"Reveal"},"retooled_gameplay":null,"edits":null,"tips":null,"classic_flare":null}