{"name":"Butler","expansion":"Cosmic Alliance","color":"Yellow","short_desc":"Gets Cards for Chores","game_setup":null,"description":"You have the power to Serve. You flip the destiny card, aim the hyperspace gate, launch ships, and perform all other manually demeaning chores for the offense after he or she signals the start of his or her encounter. Unless the offense gives you a tip of one card at random from his or her hand, you may use this power to perform your choice of either of the following: aim the hyperspace gate at any planet in the targeted system where a legal encounter can be had or launch the offense's ships from any of his or her colonies (but only as many ships as the offense specifies).\nIf the offense does tip you, you must obey his or her wishes with regard to your chores for the rest of the encounter. You must perform certain functions without reward, such as dealing out cards that a player is entitled to. You must be courteous, and a tip of one card is all that you may collect per encounter.","player":"Not Offense","mandatory":false,"phases":["Launch"],"lore":"\"To serve is to live.\" The motto of the house of Butt guides its family as they build for their true inner hope: to turn the Cosmic tables and rule forever.","wild":{"description":"As the offense, at the start of your regroup phase, you may choose another player to be the offense for this encounter by saying \"After you, I insist.\" The encounter is then carried out as usual, except that player must invite you to ally with him or her if possible. If that player wins or deals, it counts as a success for you.","player":"Offense Only","phase":"Regroup"},"super_flare":{"description":"You may demand a tip of two cards instead of one.","player":"Not Offense","phase":"Launch"},"retooled_gameplay":"Eon's Butler collected tips in Lucre rather than cards, and when passing out players' cards was able to look at any of them that were purchased with Lucre. Eon's Wild Butler was completely different: it had an effect similar to Classic Wild Filch that allowed secretly throwing other players' ships into the warp.","edits":"Edited to make the base power work correctly when the offense draws his own color, to prevent Wild Butler from allowing the player to ally against himself if he is the defense, to eliminate confusion from the incorrect statement about play resuming from where it left off, and to clarify that the surrogate offense's outcome affects whether the original offense may continue his turn.","tips":null,"classic_flare":null}