{"name":"Gambler","expansion":"Base Game","color":"Red","short_desc":"Bluffs About Card","game_setup":null,"description":"You have the power to Bluff. After your opponent reveals his or her encounter card, you may use this power to keep yours facedown, instead stating what it is (and lying if you like). If your opponent does not challenge your claim, conclude the encounter as if your statement were true, then place your encounter card facedown on the bottom of the appropriate deck instead of discarding it. If your opponent challenges your claim, reveal your card. If you lied, you lose as many ships to the warp as you had in the encounter. If you told the truth, your opponent loses as many ships as he or she had in the encounter. These lost ships may not be ships involved in the encounter. Afterwards, conclude the encounter normally using the revealed cards.\nIf another game effect switches the encounter cards (e.g., Sorcerer), you may still bluff about the card you originally played, forcing your opponent to accept or challenge your claim about the card that he or she would now reveal. If another game effect forces you to show your card early (e.g., Oracle), you may use this power at that time.","player":"Main Player Only","mandatory":false,"phases":["Reveal"],"lore":"Arising in an era of geological turmoil, the Gamblers trusted only their own audacity. The faint of heart soon perished, but the most daring rose to even greater effronteries and now launch a contest for Cosmic stakes.","wild":{"description":"As a main player, before encounter cards are revealed, you may call any number as a \"spread.\" If the cards are both attacks and are different from each other by that number or more, add the \"spread\" to your card.","player":"Main Player Only","phase":"Reveal"},"super_flare":{"description":"When stating what your card is, you may \"up the ante\" by saying how many extra ships (1-20) are at risk. The penalty for lying or calling a non-bluff is now increased by the number of ships you declared.","player":"Main Player Only","phase":"Reveal"},"retooled_gameplay":"Eon's Gambler was mandatory (which created an issue with Silencer) and allowed an unchallenged bluff card to be \"buried\" in the discard pile, rather than requiring it to be placed at the bottom of the deck. FFG fixes Eon's ambiguity about whether Gambler gets to see the opponent's card before making his claim.","edits":"Edited to resolve what happens with an unchallenged reward-back card, to eliminate the Do Not Use conflict with Sorcerer, to implement the FAQ ruling on Oracle, to eliminate trying to calculate a \"spread\" with negotiate cards, for terminology, and to fix Super Gambler's mathematical ambiguity.","tips":null,"classic_flare":null}