{"name":"Quartermaster","expansion":"Cosmic Dominion","color":"Yellow","short_desc":"Delivers Rewards","game_setup":null,"description":"You have the power to Supply. Whenever other player(s) should receive rewards, use this power. Those players announce how many rewards of each kind they will receive. You decide which colonies their ships return to. Then, you draw all of their cards together, look at them, and deliver the appropriate number to each player as you choose. If multiple sources are involved (e.g., the cosmic and reward decks), you must draw the cards as announced but may deliver them as you choose, as long as each player receives the correct number.\nIf you are due rewards as well, receive yours afterwards. Otherwise, when delivering the others' rewards you may either retrieve one of your ships from the warp, or draw one extra card from a deck those rewards came from, include that card in your delivery decisions, and keep whichever card is left over for yourself.","player":"As Any Player","mandatory":true,"phases":["Start Turn","Regroup","Destiny","Launch","Alliance","Planning","Reveal","Resolution"],"lore":"The Quartermasters were first tasked with ordering supplies for other alien races. They soon found themselves handling transportation and military equipment for the entire Cosmos, taking on more and more responsibility. As time passed, the influence of the Quartermasters became more pronounced, until the line was blurred between who was giving the orders, and who was receiving them.","wild":{"description":"When a player gains cards as rewards, you may fulfill one or more of the required number with cards of your choice from your hand.","player":"As Any Player","phase":"Any Phase"},"super_flare":{"description":"If you are also due rewards when you use your power, you may mix your hand and your own reward draws together with the cards drawn for others. Deliver the others' rewards from this mix and keep what's left as your hand.","player":"As Any Player","phase":"Any Phase"},"retooled_gameplay":null,"edits":null,"tips":null,"classic_flare":null}