{"name":"Fungus","expansion":"Cosmic Incursion","color":"Yellow","short_desc":"Attaches to Other Ships","game_setup":null,"description":"You have the power to Adhere. As a main player or ally, after your side wins an encounter in which you have at least one ship, use this power to capture any losing ships, stacking them under one or more of your ships in the encounter instead of sending them to the warp (game effects that would save ships from the warp, such as Zombie's or Healer's power, cannot prevent this). Captured ships do not have special characteristics (e.g., Macron ships are not worth four). These stacks are controlled by you. Each stack is considered to be one ship for purposes of play. Ships that are part of a stack are only freed when the stack enters the warp. Freed ships return to normal and may leave the warp as usual. If this power is stolen, your stacks do not transfer with it, but remain stacked until separated in the warp.\nAs a main player or ally, after encounter cards are revealed, use this power. Each stack you have in the encounter counts as the number of ships it contains toward your side's total instead of 1. Zapping this power does not free any captured ships.","player":"Main Player or Ally Only","mandatory":true,"phases":["Reveal","Resolution"],"lore":"The Fungus clings tenaciously to its basic perceptions, and now its neighbors find its teachings (and tendrils) rapidly growing upon them.","wild":{"description":"As the defense, when you win in your home system, you may capture all opposing ships in the encounter and place them in a circle around your system. They now count toward your total when you are the defense in your home system, but do not go to the warp if you lose. Captured ships do not have special characteristics. When you lose this flare, the captured ships return to their owners' colonies.","player":"Defense Only","phase":"Resolution"},"super_flare":{"description":"Ships adhering to yours in stacks don't have to be freed when sent to the warp. When one of your ships is released from the warp, those ships in its stack remain with it.","player":"As Any Player","phase":"Any Phase"},"retooled_gameplay":null,"edits":"Edited to fix the main player bug, to clarify interactions with game effects like Anti-Matter and Virus, to plug the lose-without-discarding leak, to delete the confusing and unnecessary phrase \"if any\" (see Appendix B), and to fix Super Fungus' incorrect prerequisite and timing icons.","tips":null,"classic_flare":null}