{"name":"Deuce","expansion":"Cosmic Incursion","color":"Yellow","short_desc":"Plays 2 Encounter Cards","game_setup":null,"description":"You have the power of Duality. As a main player, after encounter cards are selected but before they are revealed, use this power to place a second encounter card facedown off to one side. This second card is not considered your encounter card and isn't affected by game effects that target your encounter card, such as those of the Oracle or Sorcerer. If both of your encounter cards are revealed to be attacks, the second card's value is added to your side's total. If either is a negotiate, then you have played a negotiate. After the encounter is resolved, discard the negotiate card if you played one, or the higher attack card if you did not, returning the other encounter card to your hand.\nWhen checking to see if you draw a new hand, do so if you have one or fewer encounter cards left, rather than none.","player":"Main Player Only","mandatory":true,"phases":["Planning"],"lore":"Twin suns and a double moon have endowed the ambidextrous Deuce with twice the strength of their opponents. Cleverly concealing their real motives behind an amiable mask, the duplicitous Deuce see universal control within reach.","wild":{"description":"As a main player or ally, after encounter cards are revealed, if you have an attack card in your hand that is identical to one of the revealed cards, you may discard it, either adding or subtracting its value from the total of the player who played the matching card.","player":"Main Player or Ally Only","phase":"Reveal"},"super_flare":{"description":"After the encounter is resolved, you may discard both your encounter card and your extra card.","player":"Main Player Only","phase":"Resolution"},"retooled_gameplay":"FFG's Deuce plays essentially the same as Eon's, but does a better job of clarifying how to handle the extra card, as well as when the Deuce draws a new hand. Eon's Wild Deuce was completely different: it allowed a player to make one extra encounter at the end of his turn.","edits":null,"tips":null,"classic_flare":null}