{"name":"Tripler","expansion":"Base Game","color":"Red","short_desc":"Low Cards Triple, High Cards 1\/3","game_setup":null,"description":"You have the power of Thrice. As a main player, after you reveal an attack card, use this power to adjust its value. If the card's value is 10 or lower, triple its value. If the card's value is higher than 10, divide its value by three (rounded up).","player":"Main Player Only","mandatory":true,"phases":["Reveal"],"lore":"Millennia of obsessive racing and betting have given the Triplers a knack for making something out of nothing. The unfortunate downside of such flimflammery is that they have become equally prone to making nothing out of something. The Triplers now wish to redefine the Universe as an opportunity for their final race, forcing all other beings to bet everything they have on one final mad dash across the Cosmos.","wild":{"description":"As a main player, when your opponent reveals an attack card of 15 or higher, you may divide that attack card's value by 3 (rounding up) before any other game effects are applied.","player":"Main Player Only","phase":"Reveal"},"super_flare":{"description":"When you use your power, you may triple the value of your attack card if its value is 13 or lower instead of 10 or lower.","player":"Main Player Only","phase":"Reveal"},"retooled_gameplay":"The online version of Tripler had to be zapped before pods (cards) were revealed, making that version stronger: opponents would have to make their zap decision without knowing whether it would help or hurt the Tripler. That version also included a long list of examples of how to multiply or divide by three (e.g., 30 = 10), but some of its entries incorrectly rounded down (40 = 13, 13 = 4) or didn't make sense (1-1 = -3). FFG wisely did not include this \"alien math\" chart on the alien sheet. (Rounding down actually would have made this alien simpler; for many people, simply ignoring any remainder is a less complex mental exercise than rounding up.) In addition, FFG performed some much-needed liposuction on the history.","edits":"Edited to clarify that Super Tripler cannot affect the opponent's attack card.","tips":null,"classic_flare":null}