{"name":"Bully","expansion":"Cosmic Incursion","color":"Yellow","short_desc":"Selects Losing Ships","game_setup":null,"description":"You have the power to Intimidate. As a main player, after winning an encounter in which both players revealed attack cards, you may use this power to choose which ships your opponent must lose. Your opponent still loses the same number of ships he or she had in the encounter, but you take them from anywhere. If you are the defense, any of your opponent's ships that you leave in the hyperspace gate return to his or her other colonies.","player":"Main Player Only","mandatory":false,"phases":["Resolution"],"lore":"Habitually cruel to those who show signs of weakness, the Bully exploits any opportunity to run roughshod over its opponents. The false courage that is the hallmark of the Bully strikes terror into the less aggressive races of the Universe, and many flee rather than risk a confrontation. If none stand in its way, the Bully seeks to trample its way to Cosmic dominance.","wild":{"description":"As a main player, when your opponent reveals a negotiate card, you may use this flare. That player must either immediately give you a colony on a planet of your choice where he or she has a ship or else lose two ships of his or her choice to the warp. These lost ships may not be involved in the encounter. Cards changed to negotiate cards (such as by Emotion Control) still trigger this effect.","player":"Main Player Only","phase":"Reveal"},"super_flare":{"description":"You may use your power on opposing allies.","player":"Main Player Only","phase":"Resolution"},"retooled_gameplay":"Eon's Wild Bully was usable even when the player was not involved in the encounter.","edits":"Edited to avoid suggesting that Bully increases the number of ships going to the warp when something like Lunatic, Spiff, or Sting is in play; to fix the coexistence bug; and to prevent Wild Bully's target from choosing ships that he is going to lose anyway (cf. Gambler).","tips":null,"classic_flare":null}