{"name":"Aristocrat","expansion":"Cosmic Dominion","color":"Red","short_desc":"Picks Hand and Draws Extra Flares","game_setup":"After flares are added to the deck but before hands are dealt, you have one minute to look through the deck. Take any eight cards (except the Aristocrat flare) to form your starting hand, and then re-shuffle the deck.","description":"You have the power of Privilege. As a main player, any time before encounter cards are selected, you may use this power to draw a flare from the unused flare deck and add it to your hand. Then, if you have two or more flares in your hand that do not match any players' alien powers, you must choose one of those unmatched flares and remove it from the game. The flares you remove from the game cannot be drawn again.","player":"Main Player Only","mandatory":false,"phases":["Start Turn","Regroup","Destiny","Launch","Alliance","Planning"],"lore":"Beginning life with every advantage, the Aristocrats expect deference and respect from others. Drawing on a storehouse of great wealth from their feudal planet-estates, they now turn their majestic gaze upon the squabbling villeins of space.","wild":{"description":"At the start of any encounter, you may take one minute to look through the deck, choose one card, and add it to your hand. Then, shuffle the discard pile together with the deck to form a new deck. Give this flare to the Aristocrat after use (or discard it, if the Aristocrat isn't playing).","player":"As Any Player","phase":"Regroup"},"super_flare":{"description":"When using your power, instead of drawing one flare you may discard this flare either to draw three, or to take one minute to look through the unused flare deck and choose any one flare, shuffling the flare deck afterwards.","player":"Main Player Only","phase":"Planning"},"retooled_gameplay":"Eon's Aristocrat did not specify a time limit for choosing your starting hand, and did not protect other players' Super flares from being removed from the game. Eon's Wild Aristocrat did not require any shuffling. Eon's Super Aristocrat was completely different: it allowed the player to choose any seven cards from the deck when he needed to draw a new hand.","edits":null,"tips":null,"classic_flare":null}