{"name":"Engineer","expansion":"Cosmic Dominion","color":"Yellow","short_desc":"Gains Tech When Losing","game_setup":null,"description":"You have the power of Technology. As a main player, when you lose an encounter or fail to deal, you may use this power. Draw two tech cards from the technology deck (even if it is not otherwise in play). You may choose one of the drawn cards to place facedown on this sheet. If you do so, and another tech was already on this sheet, the new one replaces it. The tech(s) you do not keep are discarded.\nYou may research the tech card on this sheet normally and\/or count your ships in the warp toward its research cost. When the tech is completed, move it off this sheet. Ships counted from the warp do not return to colonies with other researching ships, but may be used for the effect of a tech such as Coldsleep Ship or Genesis Bomb.\nIf this power or a tech card on it is stolen, discarded, etc., any ships that were researching the tech card on this sheet are returned to any of your colonies.","player":"Main Player Only","mandatory":false,"phases":["Resolution"],"lore":"Engineers seek to rule the Universe through technological superiority. Valuing intelligence and ingenuity over might, they use scientific breakthroughs to subjugate those who oppose them, no matter how strong.","wild":{"description":"You may draw cards from the deck until you draw an artifact card. Non-artifacts drawn are discarded. If you exhaust the deck without drawing an artifact, take any one artifact from the discard pile. Give this flare to the Engineer after use (or discard it, if the Engineer isn't playing).","player":"As Any Player","phase":"Any Phase"},"super_flare":{"description":"When using your power, instead of drawing two tech cards you may look through the technology deck and take one card of your choice. Then, shuffle the technology deck.","player":"Main Player Only","phase":"Resolution"},"retooled_gameplay":null,"edits":"Edited to add the missing preposition (mea culpa).","tips":null,"classic_flare":null}