{"name":"Schizoid","expansion":"Cosmic Alliance","color":"Red","short_desc":"Changes Goal of Game","game_setup":"Take the six schizoid cards, choose one of them, and place it facedown on this sheet. Place the other five facedown as a deck near this sheet.","description":"You have the power to Alter Reality. The facedown schizoid card on this sheet lists the victory conditions players must fulfill in order to win the game. These conditions replace the normal victory condition of accumulating enough foreign colonies to win, and you must announce when any player(s) have fulfilled them. Alternate victory conditions (such as those of the Masochist or Tick-Tock) are not affected by this power. Any player who has completed the normal victory condition may play a Cosmic Zap on you at any time.\nEach time you are on the losing side of an encounter, the winning main player chooses a card from the schizoid deck at random and reveals it to the winner(s) of the encounter. Then, shuffle the chosen card back into the deck.","player":"As Any Player","mandatory":true,"phases":["Start Turn","Regroup","Destiny","Launch","Alliance","Planning","Reveal","Resolution"],"lore":"Long ago their system slipped into a cascading series of alternate spacetimes. Now the Schizoids believe that universal acceptance of their current reality will end their madness.","wild":{"description":"After the end of any encounter, you may switch home systems (and therefore player colors) with any other player of your choice. Afterwards, discard this flare.","player":"As Any Player","phase":"Resolution"},"super_flare":{"description":"At the end of your turn, you may choose a card from your unused schizoid deck and swap it with the schizoid card on your sheet, as long as this does not give any player an immediate win.","player":"Offense Only","phase":"Resolution"},"retooled_gameplay":null,"edits":"Edited to require Schizoid to announce winners, to avoid the problem that when a player zaps the Schizoid to win, any other joint-winners would technically lose, and to correct Super Schizoid's timing icon.","tips":null,"classic_flare":{"wild":{"description":"After the end of any encounter, you may switch home systems (and therefore player colors) with any other player of your choice. Afterwards, discard this flare.","player":"As Any Player","phase":"Resolution"},"super_flare":{"description":"If this flare is in your starting hand, reveal it and write a victory condition down instead of choosing a schizoid card. The condition must (1) be possible for all players to meet, (2) be clear to all as it happens, (3) not require remembering past events, and (4) require at least 3 foreign colonies. If this flare leaves your hand, reveal your written victory condition to all players.","player":"As Any Player","phase":"Game Setup"}}}