{"name":"Surgeon","expansion":"Cosmic Eons","color":"Red","short_desc":"Gives Aliens Facelifts","game_setup":"Draw three flares from the unused flare deck and place them facedown on this sheet as \"facelifts.\" The facelifts are not part of your hand. You may look at them at any time.","description":"You have the power of Surgery. If you are not a main player, after destiny is drawn, you may use this power to choose any other player as your \"patient\" and offer that player a wild flare as a facelift. Show one flare from this sheet to the patient as a possible improvement for his or her alien power, and offer it in exchange for anything the patient could give you as part of a deal. If the two of you agree, place the facelift faceup next to the patient's alien sheet as a temporary part of that alien power and draw a replacement for this sheet from the unused flare deck. If you do not agree, return the facelift to this sheet.\nIf you choose not to offer a facelift, instead you may use this power to discard one or more facelifts from this sheet, and then draw replacements from the unused flare deck until you have three.\nA patient may use his or her improved alien power to activate one of its facelifts whenever appropriate, even if you have lost this power. The facelift use does not count as playing a flare, but is an extension of that alien's power. After a facelift is used or Cosmic Zapped, it is removed from the game.","player":"Not Main Player","mandatory":false,"phases":["Destiny"],"lore":"Nothing beats a \"cosmic cut\" by a Surgeon... small fee required.","wild":{"description":"You may invite other players to offer you anything they could give you as part of a deal, in exchange for any alien power not in the game that has no Game Setup text. You may accept one player's offer, giving that player the use of the alien (as an additional power) for the rest of the turn. If you accept an offer, give this flare to the Surgeon after use (or discard it, if the Surgeon isn't playing).","player":"As Any Player","phase":"Any Phase"},"super_flare":{"description":"At the start of your turn, you may give yourself a facelift from your alien sheet for free.","player":"Offense Only","phase":"Start Turn"},"retooled_gameplay":null,"edits":null,"tips":null,"classic_flare":null}