{"name":"Extortionist","expansion":"Cosmic Alliance","color":"Yellow","short_desc":"Gets Half of All New Cards","game_setup":null,"description":"You have the power to Extort. After starting hands are dealt, whenever any other player collects compensation or draws new cards for his or her hand from any deck for any reason (including rewards, new hands, etc.), before those cards are added to that player's hand you may use this power to take half of them (rounded down) at random for yourself instead. A player may prevent you from extorting any cards from him or her by allowing you to send one of his or her ships of your choice to the warp, but he or she must do so before you take any cards.","player":"As Any Player","mandatory":false,"phases":["Start Turn","Regroup","Destiny","Launch","Alliance","Planning","Reveal","Resolution"],"lore":"Warped by an unstable environment, the Extortionist has long been crazed by greed. Extortionists prefer wealth that has been unjustly siphoned from honest wage-earners, and now, with their hands ever extended, they hope to amass enough for the final takeover.","wild":{"description":"When you attempt to make a deal with another player (or players), you may play this flare. If you fail to make a deal, you do not lose any ships to the warp, while the other player (or players) failing to make a deal lose twice as many ships to the warp as usual for the failed deal.","player":"Main Player Only","phase":"Reveal"},"super_flare":{"description":"You may prevent a player from stopping your extortion via ship loss.","player":"As Any Player","phase":"Any Phase"},"retooled_gameplay":"Eon's Extortionist could be paid off with Lucre, rather than by sacrificing a ship to the warp. Eon's Wild Extortionist was completely different: it extorted Lucre from a player who flipped your color twice in a row for destiny.","edits":"Edited to prevent Extortionist from affecting card draws by effects such as Chosen, Miser, Chrysalis, and gaining new tech, to restore Eon's approach of taking the cards after the other player has collected them rather than the leaky method of trying to acquire cards instead of the other player, and to recast Super Extortionist for readability and removal of the old Eon reference to a Lucre \"payment.\"","tips":null,"classic_flare":null}