{"name":"Disease","expansion":"Cosmic Incursion","color":"Red","short_desc":"Spreads to Other Planets","game_setup":null,"description":"You have the power of Contagion. Whenever any other player's color or a special destiny card that targets another player is drawn from the destiny deck, you may use this power to infect one of that player's planets. If you have a colony in the infected player's home system consisting of at least three ships, take one or more of your ships from it, moving them to any other planet in that system. On a wild destiny card, you may infect only the opponent that is chosen to be the defense.","player":"Not Defense","mandatory":false,"phases":["Destiny"],"lore":"Long ago, having decimated all life forms on their native planet, the Disease seemed in danger of extinction due to their own success. The advent of interstellar travel, however, gave them a new lease on life. Once the Disease secure a foothold on a new world, it is only a matter of time before they dominate it.","wild":{"description":"At the start of any regroup phase, you may force every other player to choose one card from his or her hand in secret. Cards are then shown simultaneously before being discarded. Any player who showed the same card type (attack, negotiate, etc.) as another player loses 3 ships to the warp. Give this flare to the Disease after use (or discard it, if the Disease isn't playing).","player":"As Any Player","phase":"Regroup"},"super_flare":{"description":"At the start of any regroup phase, you may move one of your ships from one of your colonies to another of your colonies.","player":"As Any Player","phase":"Regroup"},"retooled_gameplay":"FFG's Disease plays essentially the same as Eon's (the ambiguity of the rewrite notwithstanding), but clarifies that it also works on a special or wild destiny. Eon's Wild Disease made all other players as a group discard various resources in a manner somewhat like Sniveler's effect, and it did not have the matching aspect of the FFG version. Eon's Super Disease was completely different; it allowed Disease to spread even if it had only one ship in the host system, using ships from any of its colonies anywhere. Historical note: Eon's Disease had the power to \"spread\"; FFG's change to \"contagion\" is a weaker fit, and the game text's statement that you infect that player does not make sense: the player had to be already infected before this power could even be used, when Disease got his first colony in that system. (A power that truly \"infects\" would be one that helps you get your first colony somewhere, not your second and later ones.) The original theme made perfect sense and did not need to be tinkered with. Wording template: Among the base game and the first three expansions sets, 11 flares were designed to be given to the associated alien after use. Curiously, those 11 cards used 10 different wordings to say so. The versions on Wild Disease and Wild Filth are the most concise and nearly identical to each other, and after Cosmic Storm this template was used as the standard (on five flares in Cosmic Dominion and 11 in Cosmic Eons). Appendix B revises the earlier flares to use this template.","edits":"Edited to remove the ambiguity about the prerequisite for infecting, to clarify that Disease cannot infect himself even on a wild destiny, and to avoid misusing the game term \"reveal.\"","tips":null,"classic_flare":null}