{"name":"Klutz","expansion":"Cosmic Eons","color":"Yellow","short_desc":"Fumbles Cards and Ships","game_setup":null,"description":"You have the power of Clumsiness. Whenever you draw more than one card from the deck (including when you are dealt your starting hand), use this power to drop one or two of the drawn cards. The dropped cards are discarded without replacement.\nWhenever you place more than one of your ships on the same planet, use this power to examine any one other ship on a planet in the same system next to the planet you are placing ships on. Then drop it. The dropped ship goes to the warp.","player":"As Any Player","mandatory":true,"phases":["Start Turn","Regroup","Destiny","Launch","Alliance","Planning","Reveal","Resolution"],"lore":"The Klutzes are described by their Cosmic neighbors as being all thumbs, and this is meant quite literally. Possessing no fingers and only marginally opposable thumblets, it is a wonder they can even tie their own podpads. Klutz reproduction is thus hypothesized to occur via a phenomenon that has come to be called \"improbably fortunate collisions.\"","wild":{"description":"For the rest of this encounter, each time another player should draw more than one card from the deck, you may deal out that player's cards. Deal one card faceup to that player, deal one card to the wrong opponent, or do both (with the same card or two different ones).","player":"As Any Player","phase":"Any Phase"},"super_flare":{"description":"As a losing main player or ally, instead of sending your losing ships to the warp you may pick them up. After the other ships are resolved, drop yours as a group from a height of one foot above the targeted planet. All players' ships that end up touching or overlapping any planets stay on those planets. Ships that bounce away from all planets go to the warp.","player":"Main Player or Ally Only","phase":"Resolution"},"retooled_gameplay":null,"edits":"Edited to clarify the design intent for the the wild and super flares.","tips":null,"classic_flare":null}