{"name":"Pack Rat","expansion":"Cosmic Eons","color":"Yellow","short_desc":"Collects Objects","game_setup":null,"description":"You have the power to Collect. As a main player, before encounter cards are selected, you may use this power to take one \"object\" belonging to the other main player and place it on this sheet. That player must then give you one of his or her ships from a colony. Place it on top of the object as an owner ID. Collectible objects: a card at random from a hand, a ship from the warp, the top card from a set of essence cards, an empty planet from that player's system, a facedown, un-researched tech card, or a token on that player's alien sheet, including special tokens understood to be on the sheet, e.g. those of Fire Dancer, Grudge, or Particle. You cannot take a token if doing so would make the alien power completely unusable. You may not look at facedown collected objects. Each object you have collected adds 1 to your total when you are the defense.\nYou may release object(s) as part of a deal with any player. Also, when you are not a main player, during the alliance phase you may release objects in trades. These trades may be suggested by any player, must involve the release of one or more objects, and may include anything that could be given as part of a deal; however, only you may gain a foreign colony from such a trade. You must accept a simple trade of a foreign colony for an owner's object. You may use this power to finalize each alliance-phase trade. Each released object is restored to its original purpose and location and its ID ship returns to any of its owner's colonies.","player":"As Any Player","mandatory":false,"phases":["Alliance","Planning"],"lore":"The Pack Rats scurry about dragging objects back home, to the chagrin of prior owners.","wild":{"description":"At the start of your turn, you may take one ship each belonging to any or all players from colonies. Move each ship taken to another of its owner's colonies, or to the warp.","player":"Offense Only","phase":"Start Turn"},"super_flare":{"description":"When collecting an object, you may specify which colony the owner must choose the ID ship from.","player":"Main Player Only","phase":"Planning"},"retooled_gameplay":null,"edits":null,"tips":null,"classic_flare":null}