{"name":"Masochist","expansion":"Base Game","color":"Red","short_desc":"Tries to Lose Own Ships","game_setup":null,"description":"You have the power to Hurt Yourself. At the start of any regroup phase (before the offense retrieves a ship from the warp), use this power to win the game if you have lost all of your ships. Lost ships include those in the warp, those removed from the game, and those captured by other players.\nYou do not lose this power because of having too few home colonies, and you may still win the game via the normal method.\nDo Not Use with Healer","player":"As Any Player","mandatory":true,"phases":["Regroup"],"lore":"The Masochists suffer from a neurological disorder where they derive pleasure from self-flagellation. However, some are beginning to wonder if it's really a religious ritual to bring forth their dominance in the Universe.","wild":{"description":"During any regroup phase, you may choose a player other than the offense. That player retrieves a ship from the warp instead of the offense. You may not use this flare if the offense would then be unable to place a ship in the hyperspace gate.","player":"As Any Player","phase":"Regroup"},"super_flare":{"description":"During your regroup phase, you may choose one of your ships in the warp and remove it from the game instead of retrieving it as usual.","player":"Offense Only","phase":"Regroup"},"retooled_gameplay":"Stone's Masochist specifically exempted itself from Schizoid's alternate win conditions. Stone's Wild Masochist was completely different: it required a player to lose a colony when the flare first entered his hand, then had that player eventually give the flare to someone else to continue the cycle of destruction. Stone's Super Masochist was completely different: it let the Masochist send six of his ships to the warp. Historical note: Masochist's power is similar to Eon's Warp Factor moon, which let a player win the game if he had 19 ships in the warp.","edits":"Edited to add the Healer restriction and to fix Wild Masochist's leak that blocks the offense from loading the gate if he has ships that are not lost\/captured\/removed but are in some other state that prevents them from being usable, such as researching tech.","tips":null,"classic_flare":null}