{"name":"Plant","expansion":"Cosmic Incursion","color":"Red","short_desc":"Accumulates Opponents' Powers","game_setup":null,"description":"You have the power of Grafting. As a main player, before encounter cards are selected, you may use this power to graft any one player in whose home system you have at least one colony. If that player has not lost his or her power, you steal that power until the end of the encounter. If you lose your own power, you may not graft any power until you get your own back.","player":"Main Player Only","mandatory":false,"phases":["Planning"],"lore":"This species of Plant combines the longevity of the redwood, the persistence of the weed, and the delicacy of the fern. Slowly grafting to themselves the traits of others, they can afford to quietly wait until their enemies grow tired, then spread their tendrils unopposed throughout the Cosmos.","wild":{"description":"As a main player, after alliances are formed, you may steal the power of any ally (yours or your opponent's). Until the end of the encounter, you have the stolen power instead of your own, and the affected ally does not have the power.","player":"Main Player Only","phase":"Alliance"},"super_flare":{"description":"If you have a colony in the system of any player who wins the game, you may cause the win to be ignored. Instead, you win alone.","player":"As Any Player","phase":"Any Phase"},"retooled_gameplay":"Eon's Plant could graft any time from the moment it became the offense or defense up until card selection; FFG's Plant must wait until the start of the Planning phase. This significant reduction in scope prevents Plant from effectively grafting a large number of other powers. Also, because of the way Macron's limitation is separated from its benefit, Plant can abuse Macron to get four ships worth 4 each into the hyperspace gate for an impressive total of 16 + allies + attack card (and if Macron is in the encounter, his lone ship is now worth only 1). Eon's Wild Plant was \"promoted\" to became the FFG Super Plant (a wise change; considering the cheesiness of such a stolen win, it was good to make this nasty trick a special feature of Plant rather than something anyone else could theoretically do, out of the blue). Eon's Super effect allowed Plant to steal the power of any ally without requiring a colony in that ally's system.","edits":null,"tips":null,"classic_flare":null}