{"name":"Hypochondriac","expansion":"Cosmic Eons","color":"Yellow","short_desc":"Shares Anxiety","game_setup":"For each other player in the game, place two anxiety tokens on this sheet (e.g., eight tokens in a five-player game).","description":"You have the power of Anxiety. As a main player or ally, during the planning phase, you may use this power to name one other main player or ally who makes you anxious (for any reason). Explain why and seek a remedy. Regardless of who's making you anxious, any player or players may, individually or together, offer you a remedy of anything they could give you as part of a deal and\/or abandoning any of their colonies (returning the ships to other colonies). You have one minute to either accept one remedy or give the named player one of your anxiety tokens.\nAt the end of any encounter that has a winner and a loser, the winner may give up to half of his or her anxiety tokens (rounded up) to the loser, but may give only one if the loser is you. Anxiety tokens may also be traded in deals.\nThe player or players who have the most anxiety tokens (even you) cannot land their ships on a planet if establishing that colony would win them the game. Those ships return to other colonies.","player":"Main Player or Ally Only","mandatory":false,"phases":["Planning"],"lore":"Parlaying self-pity and hypersensitivity to a new level, the Hypochondriacs are tiptoeing into the realms of deep space to cough in the faces of the Cosmic masses.","wild":{"description":"At any time, you may place this card in front of your system and declare yourself \"not at home.\" While this card is in front of your system, no other player may aim the hyperspace gate at one of your home planets. Destiny is drawn again as necessary. At the start of your next turn, give this flare to the Hypochondriac (or discard it, if the Hypochondriac isn't playing).","player":"As Any Player","phase":"Any Phase"},"super_flare":{"description":"You may be anxious twice per encounter, but not about the same person.","player":"Main Player or Ally Only","phase":"Planning"},"retooled_gameplay":null,"edits":"Edited to restore the correct part of speech to \"abandoning.\"","tips":null,"classic_flare":null}