{"name":"Sniveler","expansion":"Cosmic Incursion","color":"Yellow","short_desc":"Catches Up When Behind","game_setup":null,"description":"You have the power to Whine. As a main player, before allies are invited, if you have more ships in the warp than all other players, have fewer foreign colonies than all other players, or lack an encounter card you want, you may use this power to whine about it. If you whine about your ships, either all other players must agree to let you retrieve all your ships from the warp, or (if possible) they each must place ships into the warp until each matches your number there. If you whine about colonies, the other players must agree to let you have one extra foreign colony of your choice or they each lose one foreign colony of their choice, returning those ships to their other colonies. If you whine about cards, you name a card you don't have (e.g., \"I don't have an attack card higher than a 15\"). Either one player must give you such a card or all players must discard all such cards in their hands. Whine only once per encounter.","player":"Main Player Only","mandatory":false,"phases":["Alliance"],"lore":"The Snivelers developed in the evolutionary shadow of a closely related but older and more gifted race. Beset by adversity at every turn, they looked to their elder brethren for succor and defense. Now grown adept at self-pity and having liquidated their generous patrons, they turn their wet, envious gaze toward the heavens.","wild":{"description":"When not a main player and not invited to ally at all, you may complain to one main player. If that player still does not invite you, he or she may not invite any allies (previous allies return to their colonies).","player":"Not Main Player or Ally","phase":"Alliance"},"super_flare":{"description":"If one or more other players win the game and you are within one colony of winning, you may join their win if they all agree. Otherwise, you may encounter one winning player of your choice who refuses. During the encounter, none of the previous winners may ally with you. If you win the encounter, you and all of your allies win the game. If you don't, the previous win stands.","player":"As Any Player","phase":"Any Phase"},"retooled_gameplay":"Eon's Sniveler did not limit the power to before ally invitations, and counted all of Sniveler's bases (rather than just external ones). It also did not limit the player to naming just one card. Eon's Super Sniveler did not prevent the previous winners from allying with you.","edits":"Edited to prevent Sniveler from whining when he is only tied for most ships in the warp or least colonies.","tips":null,"classic_flare":null}