{"name":"Crusher","expansion":"Cosmic Eons","color":"Yellow","short_desc":"Reduces Ships to One","game_setup":"Choose one unused player color and place the 20 ships of that color on this sheet (16 if you are playing with four planets per player) as crusher ships. Do not use this power unless you have an unused player color.","description":"You have the power to Crush. As a main player, before encounter cards are selected, you may use this power to crush the ships of the other main player and his or her allies. For each affected player, stack his or her involved ships and place one of your crusher ships from this sheet on top. Each crushed stack is controlled by its owner, and moves and counts as a single ship in every way. A crushed stack may not have ships added to or removed from it and may not be re-crushed into another stack.\nWhenever one or more of your ships go to the warp, you may use this power to choose one other player and crush all of that player's ships in the warp that are not already crushed.\nDuring the alliance phase, you may use this power to release one or more crushed stacks in exchange for anything their owners could give you as part of a deal, and\/or in exchange for their owners agreeing to receive cards from your hand. The released ships remain in place and the crusher ships return to this sheet.\nIf this sheet is lost or turned facedown, all crushed ships are released wherever they are.","player":"As Any Player","mandatory":false,"phases":["Start Turn","Regroup","Destiny","Launch","Alliance","Planning","Reveal","Resolution"],"lore":"The Crushers are a simple, rather brutal race with straightforward tactics.","wild":{"description":"As a main player, after encounter cards are selected but before they are revealed, you may make your opponent's ships in the encounter count as just one ship for encounter totals, compensation, and rewards.","player":"Main Player Only","phase":"Planning"},"super_flare":{"description":"When losing ships to the warp, each ship you lose may crush a different player's uncrushed ships in the warp.","player":"As Any Player","phase":"Any Phase"},"retooled_gameplay":null,"edits":"Edited to restore the correct wording convention.","tips":null,"classic_flare":null}