{"name":"Cryo","expansion":"Cosmic Incursion","color":"Yellow","short_desc":"Saves Cards for Later","game_setup":null,"description":"You have the power to Preserve. As a main player or ally, after allies are invited, you may use this power to take one card from your hand and put it in cold storage by placing it facedown on this sheet. Afterwards, draw one card from the deck. Cards on this sheet are frozen and cannot be looked at or drawn by any other player, nor are they part of your hand.\nIf you have at least eight cards on this sheet, you may discard your hand at any time to take the cards from this sheet as your new hand.","player":"Main Player or Ally Only","mandatory":false,"phases":["Alliance"],"lore":"Thanks to their unique metabolism, the Cryo are able to enter hibernation for millennia, awakening only when their people have need of them. However, the time is fast approaching when the Cryo may finally awaken all of the great heroes of their past to lead them to Cosmic conquest.","wild":{"description":"When you draw a new hand, you may first set aside any or all of your non-encounter cards (including this flare). Then, draw a new hand of eight cards before adding the cards you set aside back into your new hand.","player":"As Any Player","phase":"Any Phase"},"super_flare":{"description":"When using your power to store a card, you may swap it for a card in storage instead of drawing a card from the deck.","player":"As Any Player","phase":"Any Phase"},"retooled_gameplay":"Mr. Reda's Cryo was more flexible, allowing cards to be stored any time during the encounter. His Wild Cryo was completely different: it allowed the player to exempt two cards from compensation (essentially a subset of FFG's Wild Miser). Reda's Super Cryo did not include the ability to take the stored cards as a new hand even when they numbered fewer than eight cards. This addition by FFG makes the card more useful, but also poses a dilemma for its prerequisite and timing bars. As printed, the second effect technically can be used only during the Alliance phase and only if Cryo is a main player or ally. This is probably not what was intended. On the other hand, relaxing the bars to (As Any Player) and (Any Phase) in order to match the second effect creates a new problem for the first effect by visually implying that a card can be stored at any time. This, then, requires the phrase \"when using your power\" to reinforce that the restrictions of the base power are still in effect.","edits":"Edited for clarity, to fix Super Cryo's prerequisite and timing indicators to accommodate its second effect, and to clarify its first effect in light of the revised indicators.","tips":["Generally you will choose between using your cold storage to build up a \"power hand\" for later use, or as a dumping ground for cards you either don't want to be forced to play or don't want other players to acquire. If you are able to store a card like Hand Zap or any of the Wild flares for Deuce, Filch, Mirror, Oracle, Pacifist, and Trader, then you may want to consider using the cold storage for both purposes at the same time, since you'd be able to play the good cards and purge (or improve) the bad ones.","Once you pick up your cold storage, other players will naturally want to raid your hand. If you are able to store any protection or recovery cards like Card Zap, Cosmic Zap, Emotion Control, Finder, Ionic Gas, Wild Hacker, or Wild Miser, do so."],"classic_flare":null}