{"name":"Emperor","expansion":"Cosmic Eons","color":"Yellow","short_desc":"Demands Tribute","game_setup":null,"description":"You have the power of Tribute. Each time another player sends one or more ships into an encounter in your system or gains a colony in your system, you may use this power to demand a tribute. That player must show you one card from his or her hand and must also give you one of his or her ships from a colony. Place the card facedown on this sheet and put the ship on top of the card as an owner ID. The player may refuse if he or she has already given you a tribute during this encounter.\nAt the end of any encounter, as long as there are three or more total tributes on this sheet from at least two different players, you may look at all of them. Add the tributes you consider worthy to your hand and discard those you consider unworthy. You may return one of the unworthy tributes to its giver, causing that player to lose three ships to the warp. Then the ID ships return to any of their owners' colonies.","player":"As Any Player","mandatory":false,"phases":["Start Turn","Regroup","Destiny","Launch","Alliance","Planning","Reveal","Resolution"],"lore":"The egotistical magistrates of the Emperor race demand respect above all else. Rarely do gifts curry much favor with these narcissists, but an enticing offering made in a feigned spirit of deference can often turn away wrath, if only briefly.","wild":{"description":"When a main player declines to invite you to ally, you may show him or her a card from your hand to reconsider. If that player invites you, then he or she decides which of you must keep the card. If he or she does not, then you decide which of you must keep the card.","player":"Not Main Player or Ally","phase":"Alliance"},"super_flare":{"description":"When using your power, you may demand an encounter card, a non-encounter card, a card of one particular type, or a specific card by name. The other player must meet your demand if possible. (If not, then he or she offers any card normally.)","player":"As Any Player","phase":"Any Phase"},"retooled_gameplay":null,"edits":null,"tips":null,"classic_flare":null}