{"name":"Explorer","expansion":"Cosmic Dominion","color":"Yellow","short_desc":"Finds New Planets","game_setup":"Choose one unused player color and place four planets of that color on this sheet. Do not use this power unless you have an unused player color.","description":"You have the power of Discovery. As the offense, after the hyperspace gate is aimed, you may use this power to take a planet from this sheet, place it in the targeted system, and re-aim the gate at that planet.\nAs a main player or ally, after both players reveal attack cards, you may use this power to increase your side's total according to the planets you have discovered. Add 1 for each discovered planet you do not have a colony on, 2 for each discovered planet you coexist on, and 4 for each discovered planet you occupy alone.","player":"Main Player or Ally Only","mandatory":false,"phases":["Launch","Reveal"],"lore":"As the various child-races of the Precursors began to take to the stars, most were drawn to one another in their hunger for knowledge, trade, defense, conflict, and the other manifold needs that drove them forward. The Explorers, however, often bypassed other sentient beings in their haste to catalog new worlds. Even centuries later, this obsession continues; but now they begin to reap the rewards of their diverse discoveries.","wild":{"description":"As the offense, after the hyperspace gate is aimed, you may take the Genesis planet (whether it is in use or not), place it in the targeted system, and re-aim the gate at that planet. You may receive rewards equal to your ships in the encounter if you win or make a deal, or one reward if you do not (in addition to any other benefits of the encounter outcome).","player":"Offense Only","phase":"Launch"},"super_flare":{"description":"As a main player or ally in an encounter at any planet you discovered, after encounter cards are revealed you may add 4 to your side's total.","player":"Main Player or Ally Only","phase":"Reveal"},"retooled_gameplay":null,"edits":null,"tips":null,"classic_flare":null}