{"name":"Filch","expansion":"Base Game","color":"Green","short_desc":"Takes Opponent's Used Card","game_setup":null,"description":"You have the power of Theft. As a main player, after encounter cards are discarded at the end of an encounter, you may use this power to retrieve your opponent's card from the discard pile and add it to your hand.\nIf your opponent's encounter card gets replaced by another one, the final card he or she uses in the resolution phase is the one you may add to your hand.","player":"Main Player Only","mandatory":false,"phases":["Resolution"],"lore":"Within their genteel, sophisticated tribes, the Filches have refined the art of acquisition to a high aesthetic. The most judicious and subtle thefts are memorialized in legend and song. Lately they have taken to eyeing the depths of space and thoughtfully rippling their tentacles.","wild":{"description":"When any artifact or flare card is being played, you may discard a negotiate card from your hand to steal it. The stolen card has no effect, going into your hand instead.","player":"As Any Player","phase":"Any Phase"},"super_flare":{"description":"You may filch one other player's used encounter card whether you were involved in the encounter or not.","player":"As Any Player","phase":"Resolution"},"retooled_gameplay":"The classic edition flare matches Eon gameplay; the standard edition Wild flare reflects Mayfair's change to the card.","edits":"Edited to remove incorrect implication that all artifacts and flares have a \"victim,\" to implement the FAQ ruling on when Classic Edition Wild Filch is actually played, and to fix Classic Edition Super Filch's incorrect timing bar (so it agrees with both the text and the standard edition Super Filch).","tips":null,"classic_flare":{"wild":{"description":"You may cheat and take your ships from the warp (to colonies) or cards from the deck or discard pile, even when you are not entitled to them. If caught in the act, you lose one ship to the warp and return the items you were caught filching. You don't have to play this flare unless you are caught, but once it is revealed the deck and discards are placed next to you for easy access.","player":"As Any Player","phase":"Any Phase"},"super_flare":{"description":"You may filch one other player's used encounter card whether you were involved in the encounter or not.","player":"As Any Player","phase":"Resolution"}}}