{"name":"Ghoul","expansion":"Cosmic Incursion","color":"Red","short_desc":"Rewarded for Defeating Ships","game_setup":null,"description":"You have the power to Feast. As a main player, after you win an encounter, use this power. For each opposing ship sent to the warp as a result of the encounter, you receive one reward.","player":"Main Player Only","mandatory":true,"phases":["Resolution"],"lore":"Haunting the edges of battlefields and devouring the losers to sate their endless hunger, the Ghouls are greatly feared throughout the Universe, particularly by those aliens that normally attack en masse. More subtle tactics are required against the Ghouls, lest they emerge from battle stronger than ever.","wild":{"description":"As a main player, after you win an encounter, you may use this flare. Receive one reward for every player that opposed you in the encounter.","player":"Main Player Only","phase":"Resolution"},"super_flare":{"description":"You may use your power as an offensive ally if your side wins.","player":"Offensive Ally Only","phase":"Resolution"},"retooled_gameplay":"Field's Ghoul earned one reward for every lost ship regardless of which side it was on, counted ships removed from the game, and allowed Ghoul to earn a Lucre in lieu of a reward. Field's version also counted ships lost for any reason during the entire encounter, not just those lost as a result of the encounter. Field's Wild Ghoul was completely different: it allowed an involved player to take a card from the loser's hand for each of his winning ships. Field's Super Ghoul was completely different: it was poorly written, but appears to have allowed a winning Ghoul to earn additional rewards based on his own tokens in the challenge, and to retrieve tokens from places other than the warp. (The phrase \"from a token stealing power like the Void\" does not make any sense since Void does not steal tokens, so it is unclear whether the intent was to recover tokens \"from capturing powers like Fungus\" or to recover tokens removed from the game.)","edits":"Edited to fix the rewards bug.","tips":null,"classic_flare":null}