{"name":"Grudge","expansion":"Base Game","color":"Red","short_desc":"Penalizes for Refusing to Ally","game_setup":null,"description":"You have the power of Revenge. As a main player, after alliances are formed, use this power to give a grudge token to each player you invited to ally, but who did not do so. If you win the encounter (or make a deal), each player with a grudge token discards it and loses one ship of his or her choice to the warp. If you lose the encounter (or fail to make a deal), each player with a grudge token discards it and loses four ships of his or her choice to the warp. Otherwise, grudge tokens are discarded without effect. Lost ships cannot include ships used to ally with the other side.","player":"Main Player Only","mandatory":true,"phases":["Alliance"],"lore":"Suffering from a species history of almost uninterrupted betrayal and disappointment, the originally kind Grudges gradually grew cynical. Expecting no good will from others, they began to brood and resolved to wreak vengeance on all who would turn aside their outstretched suction disc of friendship.","wild":{"description":"As a main player, if your opponent wins the encounter, you may force his or her allies to receive nothing for the win, instead returning their ships to their colonies.","player":"Main Player Only","phase":"Resolution"},"super_flare":{"description":"You may force each player who discards a grudge token to lose 4 ships to the warp, regardless of whether or not you won the encounter.","player":"Main Player Only","phase":"Resolution"},"retooled_gameplay":"FFG introduced \"grudge tokens\" as a memory aid, and improved the competitiveness of this alien by expanding and basically reversing the gameplay. Eon penalized refusers only when Grudge wins or deals; FFG penalizes refusers whether Grudge is successful or not, but specifies the larger penalty of 4 tokens when Grudge loses or fails to deal. Retheming: Sadly, the new artwork ignores the \"suction discs\" mentioned in the classic Eon history for this alien.","edits":"Edited to define what happens when Grudge's outcome is something other than win\/lose\/deal\/fail to deal.","tips":null,"classic_flare":null}