{"name":"Invader","expansion":"Cosmic Conflict","color":"Yellow","short_desc":"Launches Sneak Attacks","game_setup":"Shuffle the three \"Invasion!\" destiny cards into the destiny deck. These destiny cards cause you to have an extra encounter when drawn during another player's turn. After you have an extra encounter due to an \"Invasion!\" destiny card, the player who drew it during his or her turn restarts his or her encounter.","description":"You have the power of Invasion. As a main player, after an \"Invasion!\" destiny card or a destiny card of your player color is drawn, you may use this power to discard your entire hand and draw a new hand of eight cards. Use this power only once per encounter.","player":"Main Player Only","mandatory":false,"phases":["Destiny"],"lore":"Originating in a place beyond space and time, the Invaders have slowly eroded away the barriers between There and Here, planning their invasion of our Universe all the while. Now, at last, their time is at hand, and they have begun tearing their way through the veils that remain, popping up in an instant to wreak havoc on everything they find in this new, unnatural place.","wild":{"description":"At any time, you may discard your hand and draw a new hand of eight cards. Give this flare to the Invader after use (or discard it, if the Invader isn't playing).","player":"As Any Player","phase":"Any Phase"},"super_flare":{"description":"During an Invasion! encounter, you may retrieve ships from the warp to send into the encounter (the normal limit of four applies).","player":"Offense Only","phase":"Launch"},"retooled_gameplay":null,"edits":"Edited to avoid implying that Invader can choose whether or not to have an Invasion! encounter, to prevent the original offense's encounters from being miscounted when one is interrupted (such as the replacement for his first one being considered his second), to fix the hand-redraw effect so that it works correctly in all encounters (there are four primary scenarios where it applies, but only one of them is in the context of an extra encounter), to make Super Invader properly use the game term \"retrieve\" (for consistency with Super Observer and clarity with effects that trigger on ship retrieval), to strike its overclarifying final sentence (avoiding any rules-lawyering against effects that send winning ships to the warp), and to eliminate sloppy \"max\" shorthand.","tips":null,"classic_flare":null}