{"name":"Machine","expansion":"Base Game","color":"Red","short_desc":"Can Continue Turn","game_setup":null,"description":"You have the power of Continuity. Your turn is not limited to two encounters. After completing each of your encounters (whether successful or not), you may use this power to have another encounter as long as you have at least one encounter card left in your hand.","player":"Offense Only","mandatory":false,"phases":["Resolution"],"lore":"A race long lost to antiquity had the foresight to construct a mammoth Machine in the core of their planet. Pouring all their knowledge and ambition into its memory banks, they programmed it with this mandate: \"Top priority... expand control, never cease... eliminate opposition, never cease... achieve mastery, never cease...\"","wild":{"description":"As the offense, you may have a second encounter even if your first encounter was not successful or you are out of encounter cards. If you have no encounter cards left, set this flare aside, draw a new hand at the start of your second encounter, and then return this flare to your hand.","player":"Offense Only","phase":"Resolution"},"super_flare":{"description":"During your regroup phase, you may draw a card from the deck instead of retrieving a ship from the warp.","player":"Offense Only","phase":"Regroup"},"retooled_gameplay":"Eon's Machine did not require that Machine \"complete\" his encounter in order to continue his turn; FFG's rewrite (probably unintentionally) implies that Machine cannot use his power if an encounter ends prematurely. Eon's Wild Machine was completely different: it forced the opponent to \"program\" the encounter cards in his hand in a specific sequence to be followed until drawing a new hand. FFG wisely abandoned that potential rulings nightmare in favor of a more conventional approach for the Wild effect.","edits":"Edited to clarify that Machine's power can be used multiple times per turn, to make Wild Machine work correctly with failed deals and to implement the FAQ erratum.","tips":null,"classic_flare":null}