{"name":"Reincarnator","expansion":"Base Game","color":"Yellow","short_desc":"Uses Powers Not in Game","game_setup":null,"description":"You have the power of Reincarnation. As a main player or ally, when your side loses an encounter (or you fail to deal), use this power to reincarnate. Draw an unused alien power at random and become that alien. If the alien has Game Setup text or is not allowed in the current game, discard it and draw again. If your side loses or you fail to deal again, discard that alien and reincarnate again. This power stays with you while you use the others. Players that copy or steal your power use both your Reincarnator power and whatever power you are reincarnated as. If while doing so their side loses an encounter or they fail to deal, they must reincarnate, losing their original power.","player":"Main Player or Ally Only","mandatory":true,"phases":["Resolution"],"lore":"Having conquered the fear of death, the Reincarnators rejoice with the passing of each of their kind. Feeling kinship with all life forms, they know that those who die will soon be born again in an endless cycle.","wild":{"description":"After another player who is not the Reincarnator is on the losing side of an encounter or fails to make a deal, you may give this flare to that player. Immediately after the end of this encounter, that player must discard his or her current alien power and draw an unused one at random. If the alien has Game Setup text or is not allowed in the current game, the player must discard it and draw again.","player":"As Any Player","phase":"Resolution"},"super_flare":{"description":"You don't have to reincarnate when your side loses or you fail to deal.","player":"Main Player or Ally Only","phase":"Resolution"},"retooled_gameplay":"Eon's Reincarnator drew a new power \"just before the next challenge,\" whereas FFG's happens immediately upon losing (or perhaps at the end of the resolution phase). Eon's version caused Plant and Insect to copy only the secondary power; FFG's is written more generically for all copying powers, and requires them to copy the Reincarnator as well as the secondary power. Eon's Wild Reincarnator was completely different: it forced all players to unconditionally reincarnate and remained in the player's hand for re-use as often as once per challenge.","edits":"Edited to fix the main player bug in the power, Wild, and Super texts, to fix the \"copying\" provisions to work with game effects like Plant that steal rather than copy, and to accommodate Wild Plant by expanding the provisions to all game effects (not just aliens).","tips":null,"classic_flare":null}