{"name":"Remote","expansion":"Cosmic Alliance","color":"Red","short_desc":"Forces Others to Ally","game_setup":null,"description":"You have the power to Control. As a main player, after you win an encounter, you may use this power to turn one ship in the encounter belonging to one opposing player into a remote. To turn the ship into a remote, remove the ship from the game and place it on this sheet.\nAs a main player, after allies are invited but before alliances are formed, you may use this power to activate one or more of your remotes. Send each activated remote to the warp. Then, the players who own the activated remotes are forced to ally with you for this encounter and must each send four ships (or as many as possible up to four). A player must send all of his or her ships if he or she has fewer than four. A controlled player must abandon home and\/or foreign colonies to send the requisite number of ships, if necessary. You cannot activate a remote belonging to the opposing main player during an encounter.","player":"Main Player Only","mandatory":false,"phases":["Alliance","Resolution"],"lore":"Evolving from a potato-like creature, the Remotes are both lazy and frightened of suffering personal harm. Why do their own fighting, they figure, when they can just use their mind control technology to get others to do it for them?","wild":{"description":"As a main player, after alliances are formed, you may force each of your allies to add one extra ship to the encounter, if able. However, they are not required to abandon colonies to do so. Your allies may exceed four ships in the encounter as a result of this flare.","player":"Main Player Only","phase":"Alliance"},"super_flare":{"description":"When using your power, you may turn a ship belonging to each opposing player into a remote, not just one opposing player.","player":"Main Player Only","phase":"Resolution"},"retooled_gameplay":null,"edits":"Edited to resolve the four-ship compulsion with effects like Macron.","tips":null,"classic_flare":null}