{"name":"Saboteur","expansion":"Cosmic Conflict","color":"Red","short_desc":"Booby Traps Planets","game_setup":"Take one trap token and two decoy tokens per player (including yourself). Place these tokens facedown next to any planets of your choice. Place no more than one token next to a given planet.","description":"You have the power to Booby Trap. Any time ships land on a planet with one of your tokens next to it, use this power to reveal the token. If the revealed token is a decoy, return the token to this sheet. If the token is a trap, send all ships on the planet (including those that just landed) to the warp and then return the token to this sheet.\nAt the start of each encounter, you may either swap any two of your tokens (whether next to a planet or on this sheet) or take a token on this sheet and place it facedown next to any planet that doesn't already have one of your tokens next to it.","player":"As Any Player","mandatory":true,"phases":["Start Turn","Regroup","Destiny","Launch","Alliance","Planning","Reveal","Resolution"],"lore":"Long demented by the magnetic unbalance of their own planet, the Saboteurs can see no way but their own and are determined to achieve it by violence.","wild":{"description":"As a main player, if you coexist on a planet with your opponent, you may declare your opponent's ships on one such planet hostage before encounter cards are selected. If you lose the encounter or fail to deal, the hostage ships immediately go to the warp. Hostage ships may not be removed from the colony until the encounter is ended, other than as part of a deal, regardless of other game effects.","player":"Main Player Only","phase":"Planning"},"super_flare":{"description":"After revealing a decoy token, you may discard a negotiate card from your hand to treat the decoy as though it were a trap token.","player":"As Any Player","phase":"Any Phase"},"retooled_gameplay":"Eon's Terrorist allowed the player to hide five \"bombs\" anywhere, requiring pencil and paper for keeping track. FFG's brilliant token-based reinterpretation gets rid of the pencil and paper and is more interactive and engaging via the start-of-encounter swap mechanism. Terrorist allowed more than one bomb on the same planet concurrently (with only one blowing up at a time), whereas Saboteur specifically prohibits multiples. Eon's Super Terrorist was completely different: it allowed the planting of one additional bomb each turn.","edits":"Edited to fix the \"shared colony\" reference (there is no such thing).","tips":null,"classic_flare":null}