{"name":"Siren","expansion":"Cosmic Conflict","color":"Yellow","short_desc":"Entices Challengers","game_setup":null,"description":"You have the power to Lure. Whenever a player in whose home system you have a colony is chosen as the defense, you may use this power to aim the hyperspace gate at one of your home planets on which you have a colony (your choice which) and become the defense instead. The encounter then continues normally.\nWhenever you win an encounter as the defense, you immediately gain a free foreign colony in the offense's home system on a planet of your choice.","player":"Not Main Player or Ally","mandatory":false,"phases":["Destiny"],"lore":"Born on a planet of beauty and illusion, the Siren entices unsuspecting travelers into her traps. Seduced by her call, the luckless guests are totally unaware of the destruction awaiting them.","wild":{"description":"For the rest of this encounter, each time cards are drawn from the deck, you may name a card (e.g., attack 30). Each time that card is drawn, it must be given to you.","player":"As Any Player","phase":"Any Phase"},"super_flare":{"description":"As the defense, before allies are invited, you may offer a colony in the offense's system to each defensive ally should you win the encounter. If you make such an offer and win, then when you gain a free foreign colony in the offense's home system, each defensive ally may either gain a colony on that planet with you using his or her ships in the encounter or receive rewards as usual.","player":"Defense Only","phase":"Alliance"},"retooled_gameplay":"Eon's and Mayfair's versions did not require Siren to have a colony in the original defense's system, but on the other hand they did not allow Siren to choose which planet will host the encounter. FFG's improved wording clarifies that it is Siren who chooses the targeted planet and where the free colony goes, and that gaining that free colony is not dependent upon Siren having actually \"lured\" the offense.","edits":"Edited to fix the incorrect prerequisite icon (and thus prevent Siren from having an encounter against herself), to clarify that Wild Siren receives all drawn copies of the named card (as ruled in Encounter magazine v1n5p8), and to define how the free colonies provided by Super Siren are populated.","tips":null,"classic_flare":null}