{"name":"Symbiote","expansion":"Cosmic Incursion","color":"Green","short_desc":"Has Twice as Many Ships","game_setup":"Choose one unused player color and take the 20 ships of that color (16 in a four-planet game), placing twice as many ships as usual on each of your planets. Your player color is that of the planets you use. Do not use this power unless you have an unused player color.","description":"You have the power of Symbiosis. You have twice as many ships as usual. This power cannot be zapped, lost, stolen, copied, or separated from your player color through any means.","player":"As Any Player","mandatory":false,"phases":["Start Turn","Regroup","Destiny","Launch","Alliance","Planning","Reveal","Resolution"],"lore":"The environmental extremes on the Symbiote's homeworld drove its two sentient species into a mutual interdependence. Now this exceptionally tough hybrid has discovered that the warp gives this two-in-one race a distinct advantage over its adversaries.","wild":{"description":"You may retrieve a ship from the warp during any other player's regroup phase.","player":"Not Offense","phase":"Regroup"},"super_flare":{"description":"You may discard this flare at the start of any regroup phase to rescue all of your ships you choose, even ones in the warp, captured, or removed from the game. Place up to eight rescued ships on each of your home planets, even if you no longer have a colony there. On each of those planets, your ships ignore any game effect that would keep them from coexisting there, for as long as that coexistence lasts. This flare may not be canceled through any means.","player":"As Any Player","phase":"Regroup"},"retooled_gameplay":"Mayfair's Symbiote did not allow ships of the secondary color to count as a colony without a normal-color ship being present, and allowed the power to be lost normally (in which case the secondary ships were frozen in place). Mayfair's Wild Symbiote was complete different; it allowed the Symbiote as defense to add other players' ships on the planet to his total. Mayfair's Super Symbiote was complete different; it allowed ships of the main color to come out of the warp to replace those of the secondary color. Unzappable: The MANDATORY icon does not make sense here, since that icon applies to use clauses and Symbiote has none. Dave Hollingsworth proposed that such aliens should use the word CONTINUOUS instead, to avoid misrepresenting what the Optional\/Mandatory icon actually means.","edits":"Edited to block power-trading and -lending effects like Changeling, Wild Philanthropist, Wild Sorcerer, and Psychic Switcheroo and to define the scope and duration of Super Symbiote's coexistence override.","tips":null,"classic_flare":null}