{"name":"Pygmy","expansion":"Cosmic Alliance","color":"Green","short_desc":"Colonies Count as Half","game_setup":"Choose one unused player color and place the five extra planets of that color in your home system (four in a four-planet game). Place two of your ships on each of your home planets. Your player color is the color of your ships. Do not use this power unless you have an unused player color.","description":"You have the power of Half. Each of your home worlds counts as only half of a foreign colony toward victory for all other players (rounding down). There can never be more than four ships on any of your planets (counting yours). When determining landing order, use the timing rules. This power cannot be zapped, lost, stolen, copied, or separated from your player color through any means.","player":"As Any Player","mandatory":false,"phases":["Start Turn","Regroup","Destiny","Launch","Alliance","Planning","Reveal","Resolution"],"lore":"When the Cosmos was young, the Pygmies were quite large, living on twin worlds, rich with valuable resources. A gravitational anomaly caused the two planets to collide, scattering the Pygmies among the ruined rubble of their former homes. With so little space to exist, each successive generation of the Pygmy race became physically smaller, but the desire to grow their empire never diminished. The inhospitable chunks of debris on which the Pygmies now live serve only as a staging ground for their invasion of other worlds.","wild":{"description":"When a player collects rewards, you may cause him or her to take only half as many rewards as usual (rounding down).","player":"As Any Player","phase":"Resolution"},"super_flare":{"description":"As the defense in your home system, if your opponent reveals an attack card, you may divide its value in half (rounded down).","player":"Defense Only","phase":"Reveal"},"retooled_gameplay":null,"edits":"Edited to define foreign colonies on Pygmy planets as being worth half only toward a game win and thus counting as full colonies for all other puposes (in order to clarify issues such as Prophet, Siren, Relic, or Winner needing to gain one foreign colony in Pygmy's system), to block power-trading and -lending effects like Changeling, Wild Philanthropist, Wild Sorcerer, and Psychic Switcheroo, and to prevent Wild Schizoid from violating the intent of the \"power cannot be lost\" clause.","tips":null,"classic_flare":null}