{"name":"Fire Dancer","expansion":"Cosmic Eons","color":"Yellow","short_desc":"Blocks Access","game_setup":null,"description":"You have the power to Awe. As a main player, when you reveal an attack card and there is no fire token in the targeted system, you may use this power to place a fire token in that system. At the end of that encounter, all attack cards revealed are placed faceup under the new fire token as fuel instead of being discarded (regardless of other game effects such as the Clone's power).\nWhen you are not a main player, after destiny is drawn, you may offer to create or expand a fire in the targeted system, and the defense may offer you anything he or she could give you as part of a deal to do so. You may use this power to accept the offer. If the targeted system does not already have a fire token, place one there. Then, you and the defense may each place one attack card from your hand faceup under that system's new or existing fire token as fuel.\nWhenever both sides in an encounter reveal attack cards in a system with a fire token, unless you are the offense or an offensive ally, the face value number showing on each fuel card is added to the defense's total. At the end of the encounter, a fire which added to the defense's total is extinguished, and the fire token and fuel cards are discarded. If this sheet is lost or turned facedown, all of your fires are extinguished.","player":"As Any Player","mandatory":false,"phases":["Destiny","Reveal"],"lore":"The Fire Dancers stir a sense of awe by performing their cultural art form for others who compete to be the next sponsor of their magical performance.","wild":{"description":"After the hyperspace gate is aimed, you may force the offense to aim the gate at a different planet in the targeted system where he or she can have a legal encounter against the defense.","player":"As Any Player","phase":"Launch"},"super_flare":{"description":"At the start of your turn, you may place one attack card from your hand faceup underneath one of your fire tokens.","player":"Offense Only","phase":"Start Turn"},"retooled_gameplay":null,"edits":"Edited to restore the correct wording convention.","tips":null,"classic_flare":null}