{"name":"Skeptic","expansion":"Cosmic Alliance","color":"Yellow","short_desc":"Doubles Risk of Encounters","game_setup":null,"description":"You have the power to Doubt. As a main player or ally, before encounter cards are selected, you may use this power to tell the opposing player: \"I doubt that you will win.\" If the opposing player agrees with you and is the offense, that player ends his or her turn and the offense's and allies' ships return to colonies. If the opposing player agrees and is the defense, all offensive ships in the hyperspace gate establish a colony on the planet as if they had won (although defending ships already on the planet remain) and defending allies return to colonies.\nIf the opposing player disagrees or \"double doubts\" you, the encounter continues. If any side loses or a deal fails, the number of ships normally lost by either of you is doubled.","player":"Main Player or Ally Only","mandatory":false,"phases":["Planning"],"lore":"During growth, one colony of marine Skeptics achieved the size and organization necessary for neuronic activity. Proliferating into super-rationality, they doubt the brash claims of others and see no reality but their own.","wild":{"description":"During the alliance phase, after you have been invited to ally, you may wait until all other invitees have made their decisions before you decide whether to ally or not.","player":"Not Main Player","phase":"Alliance"},"super_flare":{"description":"When you tell a player you doubt that he or she will win, you also tell him or her how many ships not in the encounter (1-20) are at risk (instead of your normal doubling). If he or she double doubts you, instead of doubling their losses the penalized player(s) lose that number of additional ships.","player":"Main Player or Ally Only","phase":"Planning"},"retooled_gameplay":"Eon's Skeptic said, \"the number of tokens normally lost by either of you is doubled.\" This construction used the word either in the sense of \"either or both,\" resulting in the outcomes listed above. However, FFG's subtle wording change to an either\/or construction, along with the change from passive voice to the imperative mood, introduces (probably unintentionally) a choice, forcing the Skeptic player to apply the penalty to either one player or the other. This means that when FFG's Skeptic is double-doubted as a main player and fails to deal, he technically chooses whether to double only the opponent's loss or only his own.","edits":"Edited to fix the defensive ally bug, to avoid the implication that a double-doubt immediately skips to card selection and blocks other \"before cards are selected\" actions; to clarify what happens with a rare double loss; to remove the (probably unintentional) choice of whom to punish after a failed deal; and to fix Super Skeptic's player-perspective and player-reference problems, remove its redundancy, and improve its readability.","tips":null,"classic_flare":null}