{"name":"Nanny","expansion":"Cosmic Eons","color":"Yellow","short_desc":"Motivates","game_setup":null,"description":"You have the power of Consequences. When you are not a main player, after alliances are formed but before encounter cards are selected, you may use this power to \"motivate\" one or both main players. To motivate a player, give him or her one negotiate card from your hand to add to his or her hand, and give him or her a consequence from your essence card cache to place faceup next to his or her alien sheet. If a motivated player reveals a negotiate card, carry out the incentive; the consequence card is returned to you and you receive one reward. If a motivated player does not reveal a negotiate card, carry out the punishment and leave the consequence card in place to mark the timeout.\nA player in a timeout may not participate in the game in any way or communicate with other players, nor may other players communicate with the player in the timeout. If that player is the offense, his or her turn ends. If that player becomes the defense, the offense draws destiny again. At the end of the timeout, the player returns the consequence card to you. In any case where play cannot progress because of timeouts, all other players' consequence cards are returned to you.\nWhenever one or more other players discard negotiate cards, you may use this power to retrieve one of those negotiate cards and add it to your hand. You play and discard negotiates normally.","player":"As Any Player","mandatory":false,"phases":["Start Turn","Regroup","Destiny","Launch","Alliance","Planning","Reveal","Resolution"],"lore":"The Nannies are engaged in a time out campaign throughout the Cosmos.","wild":{"description":"When the offense is going to have a second encounter, you may cancel that encounter. Give this flare to the Nanny after use (or discard it, if the Nanny isn't playing).","player":"As Any Player","phase":"Resolution"},"super_flare":{"description":"You may use your power as a main player, giving your opponent both a negotiate card and a consequence card.","player":"Main Player Only","phase":"Planning"},"retooled_gameplay":null,"edits":null,"tips":null,"classic_flare":null}