{"name":"Worm","expansion":"Cosmic Storm","color":"Yellow","short_desc":"Re-Aims Hyperspace Gate","game_setup":"You may distribute your ships among your planets however you wish as long as there is at least one ship on each planet.","description":"You have the power to Tunnel. As a main player, after encounter cards are revealed, you may use this power to re-aim the hyperspace gate at any one of the defense's colonies (in any system) or home planets, as long as the offense does not already have a colony there. All offensive and allied ships move along with the gate and the encounter then continues normally.","player":"Main Player Only","mandatory":false,"phases":["Reveal"],"lore":"Evolving beneath the rolling sands of the vast deserts of their home worlds, the Worms became adept at mounting surprise attacks and befuddling aggressors. As this fledgling race expands into the Cosmos, no alien knows where they will surface next.","wild":{"description":"At the start of your turn, you may move ships from any of your colonies to one planet in your home system that does not have a colony.","player":"Offense Only","phase":"Start Turn"},"super_flare":{"description":"You may use your power as an ally.","player":"Ally Only","phase":"Reveal"},"retooled_gameplay":"Eon's Worm generally limited the repointing of the hyperspace cone to within the system where the encounter was taking place, although in cases where Worm was encountering another player's foreign colony (such as after drawing his own color for destiny), using his power would require him to redirect to one of that player's home colonies (possibly a wording oversight). On the other hand, it allowed defensive Worm to re-point the cone at a planet where the offense already had a colony. FFG's is considerably more flexible and powerful, as it allows more latitude in taking out other players' foreign colonies and also allows Worm to shift his defensive loss to a home planet where he has no ships, as long as the offense does not already have a colony there. Eon's Super Worm was completely different: it simply expanded the power to apply when Worm was challenged on a home planet where he had no colony (which FFG's base power already allows).","edits":"Edited to eliminate the ambiguity and communicate the intended interpretation.","tips":null,"classic_flare":null}