{"name":"Doppelganger","expansion":"Cosmic Dominion","color":"Red","short_desc":"Borrows Cards to Play","game_setup":null,"description":"You have the power to Haunt. As a main player, before encounter cards are selected, use this power to discard all encounter cards in your hand (if any) and haunt one other player except your opponent. That player must give you two encounter cards of different types from his or her hand (or one if holding only one type). One of these must be the player's highest attack card, if he or she has any. When encounter cards are to be selected, if you have fewer than two encounter cards for any reason (including being zapped), you draw from the deck until you have two, discarding all non-encounter cards drawn. After cards are revealed, return any cards received from the haunted player that are still in your hand to that player.\nYou ignore all consequences of lacking encounter cards, such as drawing a new hand (even for game effects such as the Usurper's power), ending your turn, or losing the encounter due to the Laser's power.","player":"Main Player Only","mandatory":true,"phases":["Planning"],"lore":"Haunting its Cosmic colleagues, the Doppelganger often gets the better of them. Each encounter leaves its jittery victim with the feeling that there is more to every passing shadow than meets the eye.","wild":{"description":"If you are not a main player, during the alliance phase you may set your hand aside and take the hand of one player who has a colony in your system. If you take the offense's hand, he or she draws a new one. At the end of the encounter, give your hand back to that player and take back the hand you set aside.","player":"Not Main Player","phase":"Alliance"},"super_flare":{"description":"When using your power, you may also force any player other than your opponent to give you any two non-encounter cards from his or her hand (or one if he or she has only one), which you keep.","player":"Main Player Only","phase":"Planning"},"retooled_gameplay":null,"edits":null,"tips":null,"classic_flare":null}