{"name":"Seeker","expansion":"Cosmic Incursion","color":"Yellow","short_desc":"Asks \"Yes or No\" Question","game_setup":null,"description":"You have the power of Truth. As a main player or ally, after alliances are formed but before encounter cards are selected, you may use this power to ask one \"yes or no\" question of one of the main players (your opponent, if you are a main player). That player must answer your question truthfully. If your question involves the player's intentions during this encounter (such as \"Are you going to play a negotiate this encounter?\"), he or she must decide now and abide by his or her answer. Once this encounter ends, the player is no longer bound by his or her answer.","player":"Main Player or Ally Only","mandatory":false,"phases":["Alliance","Planning"],"lore":"Evolving during an intense struggle between more developed species, the Seekers gained ecological room only by acute sensitivity to their opponent's disposition. Always probing, they closely evaluate what is known. Lately, Seekers have turned searching eyes upon the Cosmos.","wild":{"description":"After allies are invited, you may choose one player who invited you and demand to see the encounter card he or she intends to play. If you ally with that player, he or she must play that card, if possible. You may demand to see only one player's encounter card per encounter.","player":"Not Main Player","phase":"Alliance"},"super_flare":{"description":"When using your power, you may ask any question, not just a \"yes or no\" question. The player you ask must still answer it truthfully.","player":"Main Player or Ally Only","phase":"Alliance"},"retooled_gameplay":"Eon Seeker could ask a question \"any time before cards are played.\" FFG Seeker is significantly weaker since it has to wait until \"after alliances are formed,\" so unfortunately it cannot use the question to influence alliances. Eon's Seeker also placed no duration on the effect of the question, which allowed locking players into game-long commitments; FFG wisely limits each question's binding effect to the current encounter. Eon's Wild Seeker is not explicitly limited to one main player per encounter.","edits":"Edited to clarify that Wild Seeker can wait until after invitations from both players.","tips":null,"classic_flare":null}