{"name":"Evil Twin","expansion":"Cosmic Eons","color":"Red","short_desc":"Avoids Penalties","game_setup":null,"description":"You have the power to Blame. As a main player, after the offense launches ships, you may use this power to declare any other player except your opponent as your good twin by giving him or her a twin token. Until the next time destiny is drawn, losses and penalties suffered by you must instead be suffered by your good twin. Then your twin token is returned to this sheet.\nLosses and penalties include cards from your hand which are supposed to be discarded, cards which you must give to another player (other than your good twin), and ships which are supposed to go to the warp. Also, essence card penalties such as tickets, traumas, and bad dreams given to you are passed on to your good twin. When you lose a colony, your good twin loses the number of ships you had on the colony to the warp. Your ships which would have been lost return to your other colonies if possible. Otherwise, they remain on the colony.","player":"Main Player Only","mandatory":false,"phases":["Launch"],"lore":"On a world where all are twins, it was not long before the powerful evil twins began dodging responsibility. ETs grow stronger as cast-off GTs habitually shoulder wrongful blame.","wild":{"description":"When you must send ships to the warp or lose cards to compensation, as long as you are not currently a good twin to the Evil Twin, you may force the player to your left to suffer the loss of the same number of ships or cards, if possible, instead of you. Give this flare to that player after use.","player":"As Any Player","phase":"Any Phase"},"super_flare":{"description":"You may become triplets by giving twin tokens to two other players, even if one is your opponent. Each of your two good twins simultaneously suffers each entire loss or penalty which would have been suffered by you. Both tokens return to your sheet on the next destiny draw.","player":"Main Player Only","phase":"Launch"},"retooled_gameplay":null,"edits":"Edited to use the correct name of Nightmare's essence cards.","tips":null,"classic_flare":null}