{"name":"Philanthropist","expansion":"Base Game","color":"Yellow","short_desc":"Gives Away Cards","game_setup":null,"description":"You have the power of Giving. As a main player or ally, after alliances are formed, you may use this power to give one card from your hand to either main player (your opponent, if you are a main player). That player immediately adds the card to his or her hand. If, after using this power, you do not have any encounter cards in your hand and you are a main player, you draw a new hand.","player":"Main Player or Ally Only","mandatory":false,"phases":["Alliance"],"lore":"Rejecting a heavy-handed, dogmatic religious background, the cynical Philanthropists have learned to parody greed itself. Knowing that the Universe cannot bring itself to reject a gift, even when it is no present, the race has grown cunning in the art of self-serving charity.","wild":{"description":"At the start of any encounter, you may send one of your ships to the warp to lend your power to another player for the duration of the encounter. Until the end of the encounter, that player is considered to have your power instead of his or her own. You may not use your power while it is loaned out. The player may not refuse the loan.","player":"As Any Player","phase":"Regroup"},"super_flare":{"description":"When encounter cards are to be selected, if you used your power to give a player an encounter card, you may force him or her to play it in that encounter if possible.","player":"Main Player or Ally Only","phase":"Planning"},"retooled_gameplay":"Eon's Philanthropist worked \"before cards are played\" and FFG works \"after alliances,\" but the two are functionally equivalent. Eon's Wild Philanthropist did not require sending a ship to the warp to use its effect. Eon's Super Philanthropist worked even on non-encounter cards.","edits":"Edited to fix the main player bug, for grammar, and to explicitly place Super Philanthropist before card selection to fix Timing Conflicts rule abuse.","tips":null,"classic_flare":null}