{"name":"Reactor","expansion":"Cosmic Dominion","color":"Red","short_desc":"Makes Aliens Super","game_setup":"Before flares are added to the deck, take the flares that match all other players' alien powers and place them faceup on this sheet. Cards on this sheet are not part of your hand. The other flares are shuffled into the deck as usual.","description":"You have the power of Radiation. As an ally, if the main player on your side wins the encounter and his or her matching flare(s) are on this sheet, use this power to give that player his or her matching flare(s).\nIf neither main player invites you to ally and one of them loses the encounter, you may add the losing main player's matching flare(s) to your hand from this sheet, discard that player's matching flare(s) from your hand, or add your own matching flare(s) to your hand from this sheet.\nWhen any player's matching flare is discarded by a player other than you, use this power to place that flare faceup on this sheet.\nIf at any time you play any other super flare and the Reactor is playing, you must give him or her this flare.","player":"As Any Player","mandatory":true,"phases":["Start Turn","Regroup","Destiny","Launch","Alliance","Planning","Reveal","Resolution"],"lore":"Originally an environmentally conscious race of peaceful activists, the Reactors sought to turn themselves into a source of sustainable energy. Yet the awesome power of Cosmic radiation and its mutating properties transformed the Reactors into radioactive freaks, eager to spread their sickness to other power-hungry cultures.","wild":{"description":"As the winning defense, you may establish one colony on any foreign planet. Give this flare to the Reactor after use (or discard it, if the Reactor isn't playing).","player":"Defense Only","phase":"Resolution"},"super_flare":{"description":"If your side wins an encounter and you have no other flares in your hand or on your sheet, you may use this flare to win the game.","player":"Main Player or Ally Only","phase":"Resolution"},"retooled_gameplay":null,"edits":null,"tips":null,"classic_flare":null}