{"name":"Particle","expansion":"Cosmic Eons","color":"Red","short_desc":"Planets Are Paired","game_setup":null,"description":"You have the power of Quantum Entanglement. As the offense or an ally, if your ship(s) should land on the targeted planet and that planet does not have an entanglement token, use this power to entangle it with another planet. Place one unassigned entanglement token next to the targeted planet and place its paired entanglement token (with the same letter) next to any other planet that is not already entangled.\nWhenever the number of your ships on any entangled planet changes, including immediately after using this power, you must add your ships to or remove your ships from the corresponding entangled planet so that you have the same number of ships on both. Ships moved to resolve the entanglement must come from or go to your other colonies on planets that are not entangled.\nWhenever you are unable to resolve an entanglement, or you have no ships on a pair of entangled planets, those planets' paired entanglement tokens are discarded.\nIf an entangled planet is removed from the game, the paired entanglement tokens affecting it are discarded. Your ships stay on the remaining planet.","player":"Offense or Ally Only","mandatory":true,"phases":["Resolution"],"lore":"p(a,c) - p(b,a) - p(b,c) < 1... Right?","wild":{"description":"At the start of your turn, you may draw one card, discard one card, retrieve one ship from the warp, or lose one ship to the warp. Then every other player must do the same, if possible.","player":"Offense Only","phase":"Start Turn"},"super_flare":{"description":"As the defense, if you win the encounter or gain a colony, you may use an unassigned pair of entanglement tokens to entangle the planet where you won or gained the colony with any other planet, as long as neither was already entangled. Immediately resolve this new entanglement.","player":"Defense Only","phase":"Resolution"},"retooled_gameplay":null,"edits":"Edited the wild flare for clarity.","tips":null,"classic_flare":null}