{"name":"Zombie","expansion":"Base Game","color":"Green","short_desc":"Never Goes to Warp","game_setup":null,"description":"You have the power of Immortality. Whenever you should lose ships to the warp, use this power to instead return them to any of your colonies and keep using them.\nIn addition, you may release any player's ships from the warp (back to any colonies he or she has) as part of a deal.","player":"As Any Player","mandatory":true,"phases":["Start Turn","Regroup","Destiny","Launch","Alliance","Planning","Reveal","Resolution"],"lore":"Shadowy forms on a dark and murky world, Zombies prized all sources of energy. They could flourish only by careful recycling of their own kind. Living on decomposed organic matter, they abhor the needless waste of war and have developed effective techniques to make sure their numbers will not be reduced.","wild":{"description":"When you lose ships to the warp, you may prevent one of your ships from going to the warp, instead returning it to one of your colonies.","player":"As Any Player","phase":"Any Phase"},"super_flare":{"description":"You may announce that each player who allies with you during an encounter may retrieve one ship from the warp and place it in the encounter. This ship does not count toward a player's normal limit of four ships in an encounter.","player":"Main Player Only","phase":"Alliance"},"retooled_gameplay":"Eon's Zombie was significantly better; it collected compensation and was not susceptible to Void under Void's previous text (both of these rulings were stated more than once by original designer Jack Kittredge in the pages of Encounter magazine (e.g. v1n4pp14,16). Eon's Wild Zombie was completely different: it allowed the player to return ships from the warp as part of a deal. (FFG's replacement effect is quite weak in that it allows only one ship to be saved per encounter; however, given the overall weakness of the base power (not receiving compensation), it's probably good that the Wild flare isn't giving Zombie's opponents a big benefit.) Eon's Super Zombie was completely different: it let the Zombie player (when involved in an encounter) keep opposing ships that should be lost, flipping them over and using them as his own.","edits":null,"tips":null,"classic_flare":null}