{"name":"Industrialist","expansion":"Cosmic Conflict","color":"Yellow","short_desc":"Adds Losing Attack Cards","game_setup":null,"description":"You have the power to Build. As a main player, after you lose an encounter in which you have revealed an attack card, your opponent must either allow you to win the encounter instead of losing, or else allow you to place your attack card faceup on this sheet, adding it to your \"stack.\" Your stack is not part of your hand and cannot be drawn from by other players or affected by other powers.\nAs a main player, after you reveal an attack card, use this power to either add or subtract the total of all the attack cards in your stack from your total. For instance, if you have an attack 08 and an attack 12 on this sheet, you would add or subtract 20 from your total.","player":"Main Player Only","mandatory":true,"phases":["Reveal"],"lore":"The Industrialists have shown themselves to be masters at learning from their own mistakes. From the ashes of each defeat arises a more powerful assault the next time. Even though the Industrialists don't seem to learn as much from their successes, the strength they've gained from their defeats is sufficient for them to carve out a piece of the Cosmos for themselves.","wild":{"description":"As a main player, after you reveal an attack card, you may draw a card at random from your opponent's hand. If it's an attack card, add it to your total, then discard it. Otherwise, return it to your opponent's hand.","player":"Main Player Only","phase":"Reveal"},"super_flare":{"description":"When adding a card to your stack, you may add either main player's revealed encounter card (as long as it's an attack) to your stack.","player":"Main Player Only","phase":"Resolution"},"retooled_gameplay":"Mayfair's version was less powerful, requiring the add\/subtract decision to be made before cards are revealed and specifying that the stack had to be discarded whenever Industrialist revealed an attack card and won the encounter. Mayfair's Wild Industrialist made sure the player drew an attack card from the opponent's hand (if possible), and then was discarded. Mayfair's Super Industrialist allowed the stack to be kept after winning the encounter (a capability which is now part of FFG's base power).","edits":"Edited to correct the timing icon.","tips":null,"classic_flare":null}