{"name":"Gorgon","expansion":"Cosmic Alliance","color":"Red","short_desc":"Petrifies Others' Ships","game_setup":null,"description":"You have the power to Petrify.\nWhenever another player's ships are about to be removed from any of your home planets and\/or any planets on which you have a colony, unless those ships are being captured, sent to the warp, or removed from the game, use this power to prevent them from moving.\nYou do not lose this power because of having too few home colonies.","player":"As Any Player","mandatory":true,"phases":["Start Turn","Regroup","Destiny","Launch","Alliance","Planning","Reveal","Resolution"],"lore":"The horrifying sight of the Gorgons petrifies any creature that looks upon them. A stranger to a Gorgon world might think this race overly fond of statuary, only to find the statues springing back to life once the Gorgons leave. Because of their powerful effect on others, the Gorgons often find it difficult to get others to cooperate in their quest for Cosmic conquest.","wild":{"description":"As a main player, before allies are invited, you may choose a planet. Ships on that planet cannot defend or move during this encounter and cannot be sent to the warp during this encounter unless the planet is removed from the game.","player":"Main Player Only","phase":"Alliance"},"super_flare":{"description":"You may cause any Cosmic Zap played on you to be discarded without effect.","player":"As Any Player","phase":"Any Phase"},"retooled_gameplay":"Whereas Mayfair's Gorgon froze opposing ships at all times except when they were supposed to be lost to the warp, FFG has unfortunately given Gorgon's victims a choice and thus the flexibility to exploit the power to their own benefit. Any time you must send ships of your choice to the warp (e.g., when failing to make a deal), just select any that are petrified, then choose to keep them on that planet instead of losing them. Or, to get out from under Gorgon's influence whenever you are allowed to select ships to move (e.g., when populating the hyperspace gate), select some that are petrified and move them to the warp instead of their intended destination. This also leads to ambiguity since it is not always clear, when ships are being sent to the warp, which player is technically the one who \"attempts to move\" them. It is likely that these changes were unintended, and so the revised wording presented here restores Mayfair's original effect, with tweaks to account for captured and eradicated ships. (However, see resolution sequence for comments on how the as-written version would interact with the fact that winning offensive ships land on the targeted planet before the losing defensive colony is removed.)","edits":"Edited to prevent opponents from exploiting Gorgon to their benefit, to account for capturing and eradication, to clarify Wild Gorgon so it refers not just to \"destroyed\" planets but to planets \"removed from the game\" for any reason, and to clarify Super Gorgon's awkward construction by using the wording from Wild Healer, whose effect it duplicates.","tips":null,"classic_flare":null}