{"name":"Bride","expansion":"Cosmic Dominion","color":"Yellow","short_desc":"Marries Players","game_setup":null,"description":"You have the power to Marry. As a main player, before allies are invited, you may use this power to \"marry\" your opponent. That player must choose one of his or her ships and place it on this sheet. You may be married to only one player at a time.\nYou and your \"spouse\" may ally with each other without being invited and may show each other any cards in your hands at any time. Once per encounter, you may use this power to allow a trade of one card each from your hand and your spouse's hand.\nYou may \"divorce\" your spouse at any time by turning that player's ship on your sheet upside-down and taking half of the cards in his or her hand at random (rounded down) as \"alimony.\" You may not remarry a player you previously divorced. If this sheet is lost or turned facedown, you must divorce your current spouse without receiving alimony.","player":"As Any Player","mandatory":false,"phases":["Start Turn","Regroup","Destiny","Launch","Alliance","Planning","Reveal","Resolution"],"lore":"The Bride has left a trail of broken circulatory pumps and legal hijinks across the Cosmos, and yet her allure is impossible to resist. The Bride, however, eschews the social pressure of the present and rejects wallowing in the past as she drifts through space longing for a fantasy future with her true soulmate, be it a low-life Hate or a noble Ethic.","wild":{"description":"As the defense, after the offense launches ships, you may run away from the encounter. The offense sends his or her ships from the gate to any one of his or her home planets, or any one unoccupied foreign planet, then ends his or her turn.","player":"Defense Only","phase":"Launch"},"super_flare":{"description":"You may remarry an opponent that you previously divorced. Turn that player's ship on your sheet faceup. Do not receive alimony from that opponent again.","player":"Main Player Only","phase":"Destiny"},"retooled_gameplay":null,"edits":null,"tips":null,"classic_flare":null}