{"name":"Visionary","expansion":"Cosmic Conflict","color":"Yellow","short_desc":"Dictates Encounter Card","game_setup":null,"description":"You have the power of Perception. As a main player, before encounter cards are selected, you may use this power to specify an encounter card which your opponent must play (for instance: \"You will play an attack 06\"). If your opponent does not have such a card, he or she may play any encounter card he or she wishes. If your opponent does have the card, however, he or she must play it unless prevented by another player.","player":"Main Player Only","mandatory":false,"phases":["Planning"],"lore":"Once an ancient race of wandering fortune tellers, the Visionaries have recently stirred debate among philosophers throughout the Cosmos. Does the mystic sight of the Visionary merely foretell the future, or does it shape it? This intellectual debate between advocates of causationalism and free will has tended to mask the alarming growth of the Visionary empire. As for the Visionaries themselves, they loathe logic and philosophy, preferring a more intuitive approach to the problems of Cosmic domination.","wild":{"description":"As a main player, during any phase, you may name a specific card. Each player then secretly shows you that card if he or she has it, or any other card if he or she doesn't have it.","player":"Main Player Only","phase":"Any Phase"},"super_flare":{"description":"You may use your power even if you are not a main player. You must specify which main player you are using your power against.","player":"Not Main Player","phase":"Planning"},"retooled_gameplay":"Eon's Wild Visionary had to be used before encounter cards are selected. FFG's version is more versatile; for example, if you know your opponent has a particular encounter card in his hand, after cards are selected you could use this flare to find out whether he still holds that card; if not, then you know he just played it as his encounter card. This would be most useful if you have an alien power that is used after cards are selected but before they are revealed (such as Amoeba, Calculator, Citadel, Deuce, Fury, Graviton, Merchant, Mirror, or Sorcerer).","edits":null,"tips":null,"classic_flare":null}