{"name":"Peddler","expansion":"Cosmic Eons","color":"Red","short_desc":"Sells Cards","game_setup":"After all players are dealt their starting hands, draw a total of 8 cards from the cosmic, reward, and\/or tech decks (whichever are in the game). Look at the cards and create a \"store\" of six faceup cards and two facedown cards. Cards in your store are not part of your hand, but you may look at them at any time.","description":"You have the power to Sell. After alliances are formed, if you are not a main player, once per encounter you may use this power to sell one card, either publicly from your faceup store cards or privately from your facedown store cards. Players may offer you anything they could give you as part of a deal to buy that card. In a private sale, you may show the card to whichever player(s) you like; those not shown the card may still make a \"blind\" offer. When you sell a tech card, its owner places it facedown and researches it normally. Any cards you gain from the sale must be placed in your hand.\nAt the end of any encounter, you may place your hand to one side while you pick up all of the cards in your store. Discard one of them. Then draw cards to restock your store back to eight from any or all of the decks available, and reopen your store with any six of its cards faceup and the other two facedown.","player":"Not Main Player","mandatory":false,"phases":["Alliance"],"lore":"The Peddlers have been shaking hands and hawking their wares across the Cosmos and hope to be on every corner of every planet very soon!","wild":{"description":"At the start of your turn, you may spread your hand faceup out in front of you and sell it, with or without this flare, to another player. Players may offer you anything they could give you as part of a deal. Accept an offer or discard your hand; then draw a new hand before receiving your offer and returning this flare to whoever now owns it.","player":"Offense Only","phase":"Start Turn"},"super_flare":{"description":"At the start of any encounter, you may choose one faceup card from your store and add it to your hand. If it is a tech card, place it in front of you to research instead.","player":"As Any Player","phase":"Regroup"},"retooled_gameplay":null,"edits":null,"tips":null,"classic_flare":null}