{"name":"Will","expansion":"Base Game","color":"Green","short_desc":"Not Controlled by Destiny","game_setup":null,"description":"You have the power of Choice. As the offense, after destiny is drawn, use this power to declare which other player will be the defense (regardless of the destiny draw). You may encounter any one of that player's colonies or home planets of your choice instead of encountering the player mandated by the drawn destiny card (for example, you could choose to encounter the Virus' ships on the Mind's planet, even if you were actually directed to have an encounter with the Oracle by the destiny card). Any other effects caused by the drawn destiny card still take place as usual.","player":"Offense Only","mandatory":true,"phases":["Destiny"],"lore":"Arising on a cold and barren asteroid, the Wills gave no thought to legal niceties in their relentless struggle to capture the faint rays of a dying star. Unfairly charged with preying upon the weak, they wish only to find locations in which they may spread their solar membranes, unopposed.","wild":{"description":"As the offense, when any other player's color is drawn from the destiny deck, you may have an encounter with that player in any system, not just his or her home system.","player":"Offense Only","phase":"Destiny"},"super_flare":{"description":"You may look at any one other player's hand before deciding whom to encounter.","player":"Offense Only","phase":"Destiny"},"retooled_gameplay":"Eon's version did not allow Will to draw destiny at all; Mayfair's rewrite, which FFG follows, lets other powers (like Shadow\/Assassin) still do their dirty work, and probably would also nicely accommodate any future destiny enhancements that come along (such as something like Mayfair's Comets). Unfortunately, FFG's decision to place the timing of Will's choice in the Launch phase rather than the (cleaner) Destiny phase causes issues (such as Disease needing to know where he can spread when Will draws a wild destiny) and poses a discontinuity that some future game effects may need to be carefully written around. In addition, FFG's version of Will cannot reclaim an empty home planet after drawing his own color; his power always forces him to choose another player to be the defense. Eon's Wild Will was completely different: it allowed the player to dictate the terms of a deal when other players failed to make one. Because of questions like these, the Cosmodex revises Will to declare who the defense will be while it is still the Destiny phase.","edits":"Edited to put Will's declaration of the defense in the Destiny phase where it belongs (for compatibility with existing and future effects), to correctly encounter a \"player\" instead of an \"alien\" (a relevant distinction for Reincarnator, Precursor Seed, and multiple-power games), to implement the FAQ ruling that Will must encounter an actual colony of ships unless he is encountering a player in that player's home system, and to clarify that Wild Will works with Dictator but does not work when you draw your own color.","tips":null,"classic_flare":null}