{"name":"Pentaform","expansion":"Cosmic Dominion","color":"Red","short_desc":"Has Five Life Stages","game_setup":"Draw five flares from the unused flare deck and arrange the matching alien powers in front of you as \"life stages,\" in the order of your choosing. If any have Game Setup text or are not allowed in the current game, discard them and draw again. Remove the five flares from the game and slide this sheet partway under the leftmost life stage.","description":"You have the power to Evolve. You use both your Pentaform power and whichever life stage it is underneath (zapping one does not zap the other).\nWhenever you gain a foreign colony, use this power to move this sheet one life stage to the right (if possible). Whenever you lose a foreign colony, use this power to move this sheet one life stage to the left (if possible).","player":"As Any Player","mandatory":true,"phases":["Start Turn","Regroup","Destiny","Launch","Alliance","Planning","Reveal","Resolution"],"lore":"Evolving on the fifth moon of the fifth planet of their star system, the Pentaforms coincidentally developed with five distinct life stages. Though differing in form from one specimen to another, all Pentaforms go through cataclysmic changes from each life stage to the next: childhood, adolescence, adulthood, middle age, and seniority. They have been causing a handful of trouble for the rest of the galaxy.","wild":{"description":"You may discard your current alien power and draw two cards from the unused flare deck. Choose one of these two aliens and become that alien. If either has Game Setup text or is not allowed in the current game, discard it and draw again. Shuffle those two flares into the deck. Give this flare to the Pentaform after use (or discard it, if the Pentaform isn't playing).","player":"As Any Player","phase":"Any Phase"},"super_flare":{"description":"At the start of any encounter, you may swap the positions of any two of your life stages (without moving the Pentaform sheet).","player":"As Any Player","phase":"Regroup"},"retooled_gameplay":null,"edits":null,"tips":null,"classic_flare":null}