{"name":"Fido","expansion":"Base Game","color":"Yellow","short_desc":"Retrieves Discarded Cards","game_setup":null,"description":"You have the power to Fetch. After encounter cards are discarded at the end of an encounter, you may use this power to retrieve one of the discarded cards and offer it to another player. If the card is refused, you may keep or discard it. If the card is accepted, the other player keeps the card and you may retrieve one ship from the warp or draw one card from the deck. You may retrieve only an encounter card that was used to resolve the encounter, not one that was discarded for some other reason.","player":"As Any Player","mandatory":false,"phases":["Resolution"],"lore":"Trained for generations by a strict, but unknown, alien race, the Fidos were bred for retrieval. Slinking out on their own, they cannot help but fetch the debris of outer space for whomever happens by, knowing they will still be rewarded in some way.","wild":{"description":"As a main player, before encounter cards are selected, you may force your opponent to take the top card of the discard pile and add it to his or her hand. You then draw a card from the deck.","player":"Main Player Only","phase":"Planning"},"super_flare":{"description":"You may fetch any or all of the encounter cards discarded at the end of an encounter and offer them, one by one, to the other players in any order you choose.","player":"As Any Player","phase":"Resolution"},"retooled_gameplay":"Freels' Fido retrieved cards \"on their way to\" the discard pile rather than after being discarded, was not limited to encounter cards discarded at the end of an encounter, defined the payment as a reward (which would have let Fido draw from the reward deck when an opponent keeps an offered card), and made the reward mandatory (FFG's version appears to make it optional whether you collect the reward-that-isn't-a-reward). Freels' Wild Fido was completely different: it allowed the player to take the top card of the discard pile (selecting any one card if several were just discarded). Freels' Super Fido was less flexible, requiring the player to fetch all cards discarded at the same time.","edits":"Edited to specify what happens if Fido does not want to keep a card that has been refused, to resolve the conflict between \"you may\" implying the payment is optional and \"either\" implying it is mandatory, and to clarify the scope of the power as defined in the FAQ.","tips":null,"classic_flare":null}