{"name":"Oracle","expansion":"Base Game","color":"Green","short_desc":"Foresees Opponent's Card","game_setup":"Take your 5 privileges as your essence card cache. You automatically start the game as the first player.","description":"You have the power of Greed. Every time you draw a new hand of cards, including at the beginning of the game, draw one additional card.\nYou accumulate privileges up to the highest number of foreign colonies that has been reached by any player. Use this power whenever any one player has more foreign colonies than the number of your faceup privilege cards. Look through your essence card cache, choose one privilege, and play it faceup next to this sheet. If you are zapped, the privilege you attempted to play is removed from the game.\nYou have the power to Foresee. As a main player, when encounter cards are to be selected, use this power to force your opponent to play his or her encounter card faceup. Only after you have seen your opponent's card do you select and play your card.","player":"Main Player Only","mandatory":true,"phases":["Planning"],"lore":"During millennia of civilization, the ancient Oracles developed perceptiveness about the intentions of others to uncanny lengths. While reluctant to test the outer limits of their vision, they find even short-range prescience has given them the reputation of great wisdom.","wild":{"description":"As a main player, before encounter cards are selected, you may mix your hand with that of your opponent, then take at random as many cards as you had in your hand, giving the rest to your opponent.","player":"Main Player Only","phase":"Planning"},"super_flare":{"description":"As a main player, you may end an encounter after your opponent plays his or her card. Your opponent takes back his or her card, the offense's and allies' ships return to colonies, and play continues as if a deal had been made.","player":"Main Player Only","phase":"Planning"},"retooled_gameplay":"Eon's version delayed Oracle's card play until what is now known as the Reveal phase; FFG's rewrite wisely avoids ruling complications by keeping the card plays in the Planning phase and still going through a normal Reveal phase (even though the opponent's \"revelation\" is perfunctory at that point). It's unfortunate they didn't apply their excellent wording improvements to Super Oracle as well (the incorrect use of the word \"reveal\" led them to wrongly use a (Reveal) icon instead of (Planning)).","edits":"Edited to move the timing to the correct \"subphase,\" for agreement between base power and Super flare, to avoid implying that the faceup card is being \"revealed\" in the planning phase, to fix the defensive ally bug, for terminology, and to correct Super Oracle's timing indicator. (The Super flare must be used before Oracle plays his encounter card, so it can't wait until the Reveal phase. This error probably occurred because the flare was not revisited when the use of the base power was moved from Reveal to Planning. The opponent is not actually \"revealing\" his card yet, but rather he is playing it in such a way that the other players know what it is. In any event, it is clear from Oracle's base power that Super Oracle must make his choice during the Planning phase.)","tips":null,"classic_flare":null}