{"name":"Alien","expansion":"Cosmic Eons","color":"Red","short_desc":"Abducts Other Aliens","game_setup":null,"description":"You have the power to Traumatize. At the start of another player's turn, you may use this power to capture one of that player's ships from any colony where he or she has at least two ships. Choose one trauma from your essence card cache and place it facedown next to this sheet with the captured ship on top. You may not hold more than one of each player's ships captive at a time.\nWhen you are not the offense, before encounter cards are selected, you may use this power to release one or both of the main players' ships you have captured on previous turns. Released ships join the encounter, going to the hyperspace gate or the targeted planet as appropriate (this may exceed any gate limits), and the trauma card under each one is placed facedown, unseen, near the corresponding main player.\nWhen a player with a trauma card reveals an encounter card, he or she must also reveal that trauma card and carry out its effect. Revealed trauma cards are returned to you.\nIf this sheet is lost or turned facedown, all ships you have captured go to the warp and their trauma cards are returned to you.","player":"Not Offense","mandatory":false,"phases":["Start Turn","Planning"],"lore":"The Aliens are actually quite child-like in their boundless curiosity, and are unaware that their simple abduction games are not appreciated.","wild":{"description":"At the start of your turn, you may ask one other player to give you five ships which you will hold as hostages, returning them at the end of your turn. Instead of giving you the ships, the player may offer you anything he or she could give you as part of a deal and\/or agree to receive cards from your hand. If you accept the deal, all ships remain in place.","player":"Offense Only","phase":"Start Turn"},"super_flare":{"description":"You may capture a player's ship even if you already have one or more captives from that player. Place a trauma card under each ship you capture.","player":"Not Offense","phase":"Start Turn"},"retooled_gameplay":null,"edits":null,"tips":null,"classic_flare":null}