{"name":"Miser","expansion":"Base Game","color":"Green","short_desc":"Gets Second Hand","game_setup":"You are dealt two separate eight-card hands. Look at them and choose one to be your \"hoard.\" Place it facedown on this sheet.","description":"You have the power to Hoard. Whenever you wish to play a card, you may use this power to play a card from your hoard instead of your normal hand. You may not add cards you gain to your hoard, and other players may not look at or draw cards from your hoard. If there are no encounter cards left in your hoard, you may show it, then discard it and get a new eight-card hoard. Cards played from your hoard which should return to your hand must return to your hoard instead.","player":"As Any Player","mandatory":false,"phases":["Start Turn","Regroup","Destiny","Launch","Alliance","Planning","Reveal","Resolution"],"lore":"Barely eking out a living on their shriveled moon, the Misers for generations secreted away their small annual surplus. But as the hoard grew, so did their greed, until now they prepare to risk their holdings for greater Cosmic booty.","wild":{"description":"When you draw a new hand or another player takes compensation from you, you may place this card and two others facedown in front of you until afterwards. If compensation is being taken from you, the facedown cards may not be taken. If drawing a new hand, you receive a full hand in addition to the facedown cards.","player":"As Any Player","phase":"Any Phase"},"super_flare":{"description":"At the start of your encounter, you may draw one card from the deck and add it to your hoard.","player":"Offense Only","phase":"Regroup"},"retooled_gameplay":"FFG Miser specifically allows the player to choose which starting hand will be the hoard. Eon Miser protected the hoard from \"loss of cards because of other powers, Edicts, or consolation,\" whereas FFG Miser protects the hoard only from its cards being looked at or drawn. The difference, then, is that Eon hoards were vulnerable to all flare-based effects but could not be harmed by forced discarding from non-flares, while FFG hoards can experience forced discarding from any kind of game component (as long as that component is not limited to targeting hands, since the hoard is not a hand). Eon was clear about getting a new hoard using the normal hand-drawing rules, but FFG seems to give the hoard its own (relatively unrestricted) method for refresh rather than link it to the normal hand-drawing rules. Eon's Wild Miser was completely different: it allowed a player to win the game with one base fewer than the number normally required.","edits":null,"tips":null,"classic_flare":null}