{"name":"Tortoise","expansion":"Cosmic Eons","color":"Red","short_desc":"Gets a Late Start","game_setup":null,"description":"You have the power to Dawdle. At the start of each of your turns, use this power to receive four rewards and end your turn.\nEach time you draw a card as a reward, draw the top card from an appropriate deck or discard pile. Any or all cards you draw as rewards may be placed facedown on this sheet in your \"shell.\" Your shell is not part of your hand and may not be used until the end of the game, but you may look at it at any time.\nWhen the game ends, if you have not lost this power, add all cards in your shell to your hand. If you are not one of the winners, take one final turn. You cannot use this power to gain rewards and no other players may become the offense regardless of other game effects. You may have as many encounters as you can, even if they are not successful and even if you lose this power, until you either run out of encounter cards or become a winner, sharing the win with all other players who are now achieving a victory condition, if any.\nWhenever you are part of a shared win, if you have not lost this power you may either accept the shared win or attempt to win alone by having one more encounter (if you still have an encounter card). Other players who were part of the shared win may not ally with you. If you gain a foreign colony, you win alone. If not, you lose the game and the other winner(s) win.","player":"Offense Only","mandatory":true,"phases":["Start Turn"],"lore":"The Tortoises shock all by moving the finish line to where they alone can venture.","wild":{"description":"On your turn, if you have had two successful encounters, you may have a third if you have an encounter card.","player":"Offense Only","phase":"Resolution"},"super_flare":{"description":"As the defense, you may refuse to allow the offense to encounter you. The offense must encounter a different player and, if required to use destiny, must draw destiny again until he or she is able to encounter a different player.","player":"Defense Only","phase":"Destiny"},"retooled_gameplay":null,"edits":"Edited so that Wild Tortoise does not require multiple encounter cards to continue the turn.","tips":null,"classic_flare":null}