{"name":"Cyborg","expansion":"Cosmic Alliance","color":"Yellow","short_desc":"Has 3 Extra Faceup Cards","game_setup":null,"description":"You have the power of Bionics. At the start of every encounter, if you have fewer than three cards on this sheet, draw cards from the deck to place faceup on this sheet until you have three. These cards are not part of your hand.\nAt any time, you may play a non-encounter card that is faceup on this sheet as though it were in your hand.\nAs a main player or ally, after your side reveals an encounter card, you may use this power to discard your side's revealed card and replace it with an encounter card that is faceup on this sheet.\nCards from this sheet that should return to your hand return here instead.","player":"Main Player or Ally Only","mandatory":false,"phases":["Reveal"],"lore":"A perfect marriage of biology and technology, the Cyborgs have been an odd mix of contrasts ever since they first showed up in the Cosmos. Loyal and caring toward one another, yet coldly logical when need be, the Cyborgs have done the math and know that they will eventually rule the Cosmos for the greater good of all races.","wild":{"description":"You may play the top card of the discard pile as though it were in your hand. You may use this flare only once per encounter.","player":"As Any Player","phase":"Any Phase"},"super_flare":{"description":"When drawing cards to place on your sheet, you may draw until you have four there instead of three.","player":"As Any Player","phase":"Regroup"},"retooled_gameplay":null,"edits":"Edited for wording consistency, to fix major leaks, to eliminate the ambiguity about cards that \"would normally be discarded,\" to eliminate redundancy, for readability, to fit the text onto the standard art template, and to fix various issues with Super Cyborg not actually being \"played,\" leaving your hand temporarily but remaining under your control, turning up as one of your bionics cards, etc.","tips":null,"classic_flare":null}