{"name":"Magician","expansion":"Cosmic Incursion","color":"Red","short_desc":"Steals Card, Confounds Opponent","game_setup":null,"description":"You have the power of Prestidigitation. As a main player, when encounter cards are to be selected, use this power to force your opponent to play two encounter cards facedown. Choose one of the two cards at random and add it to your hand. Then, play an encounter card from your hand normally (even the card you just took). Your opponent must play the card you didn't choose as his or her encounter card. The rest of the encounter is resolved as usual.\nIf another game effect requires you to play your card first (e.g., Oracle, Wild Magician), you must do so. You then still use this power, but may not change the card you played.\nIf your opponent has only one encounter card left in hand (and proves it by showing you his or her hand except for the encounter card), this power has no effect.","player":"Main Player Only","mandatory":true,"phases":["Planning"],"lore":"Lacking any natural weapons with which to defend themselves, the Magicians had to use their keen intellect to survive. Confusing and confounding their enemies became second nature to the wily Magicians. Indeed, many a would-be Cosmic conqueror has found occasion to curse the day that the Magicians swindled a visiting alien out of his spaceship and soared out into the Cosmos.","wild":{"description":"As a main player, when encounter cards are to be selected, you may force your opponent to play three encounter cards facedown. Shuffle these cards around on the table. Your opponent chooses one of the facedown cards at random, which he or she then plays, returning the other two to his or her hand. If your opponent has fewer than three encounter cards, he or she first discards his or her hand and draws a new one.","player":"Main Player Only","phase":"Planning"},"super_flare":{"description":"When using your power, you may turn one of your opponent's two cards faceup before choosing. Choose either the faceup or facedown card and take it. Your opponent plays the card you did not choose, as usual.","player":"Main Player Only","phase":"Planning"},"retooled_gameplay":null,"edits":"Edited to move the timing to the correct \"subphase,\" to resolve the stalemate between Magician and Wild Magician while simultaneously eliminating the Do Not Use conflict with Oracle, to add missing gender-neutral language, and to clarify that Wild Magician's hand refresh is there to enable the flare (not replace its normal function).","tips":null,"classic_flare":null}