{"name":"Citadel","expansion":"Base Game","color":"Red","short_desc":"Builds Citadels on Planets","game_setup":null,"description":"You have the power of Fortification. During each player's encounter, after destiny is drawn, you may play an attack card from your hand faceup next to any planet in any system as a citadel.\nIf a planet with one or more citadels is targeted, after encounter cards are selected but before they are revealed, you may use this power to activate all citadels on the planet. If you do, add their combined value to the defense's total for the encounter. If you activate your citadels on a planet and the defense loses the encounter, discard the citadels. Otherwise, they stay in place.\nDiscard citadels if their planet is destroyed or this sheet leaves the game.","player":"As Any Player","mandatory":false,"phases":["Planning"],"lore":"Brilliant architects who obsessively build vast fortresses as they travel throughout the Cosmos, the Citadels are often welcomed with open arms by the other races, who are delighted to benefit from the Universe's best defenses. Of course, what the Citadels don't tell them is that these fortifications only work when the Citadels want them to do so.","wild":{"description":"As a main player or ally, after encounter cards are revealed, you may add 5 to the defense's total.","player":"Main Player or Ally Only","phase":"Reveal"},"super_flare":{"description":"Your citadels may either add to or subtract from the defense's total when you activate them. Citadels are still discarded if the defense loses, even when they are used to subtract.","player":"As Any Player","phase":"Planning"},"retooled_gameplay":null,"edits":"Edited to clarify that placing a citadel card is limited to once per encounter rather than once per turn, to plug the undefined-outcomes leak, and to give the power a cleaner exit condition (even though this contradicts the FAQ).","tips":["Normally you build positive citadels on your own planets and negative ones on other players' planets, of course, but medium to high attack cards placed in Anti-Matter's or Loser's system can help you and your allies win encounters there (even if Loser doesn't call an upset)."],"classic_flare":null}