{"name":"Architect","expansion":"Cosmic Eons","color":"Red","short_desc":"Stacks Planets","game_setup":null,"description":"You have the power to Build Towers. When you win as a main player, at the end of the encounter use this power to create or expand a tower in your opponent's system. If you do not already have a tower in that system, choose two of that system's planets (if the targeted planet is in that system, it must be one of your choices). Merge those two planets together, placing all ships from both on the top of the two-level tower. If you already have a tower in the opponent's system, then instead select another planet in that system and merge it into the tower as a new level, placing its ships on top.\nOnly normal player-color planets can be merged. Do not create a merged planet using planets with unused player colors or that would exceed any limits, such as more than one entanglement token, etc.\nAs a main player, after encounter cards are revealed, use this power to double your total if you have a tower of two or more levels in the opponent's system, a tower of three or more levels in a system adjacent to the opponent's system, or a tower of four or more levels in any system.\nEach tower counts as a single planet. Towers are permanent, even if you lose the use of them. If any player cannot gain enough foreign colonies to win the game due to insufficient foreign planets, you win the game.","player":"Main Player Only","mandatory":true,"phases":["Reveal","Resolution"],"lore":"Skilled builders, the Architects now seek to drag the works of others into their constructions.","wild":{"description":"As a main player, after encounter cards are revealed, you may discard one attack card from your hand and then add 1 for each card below it in its discard pile to your total. Give this flare to the Architect after use (or discard it, if the Architect isn't playing).","player":"Main Player Only","phase":"Reveal"},"super_flare":{"description":"When using your power, you may create or expand a tower in your own system instead of your opponent's system.","player":"Main Player Only","phase":"Resolution"},"retooled_gameplay":null,"edits":null,"tips":null,"classic_flare":null}