{"name":"Chronos","expansion":"Cosmic Incursion","color":"Yellow","short_desc":"Can Replay Encounter","game_setup":null,"description":"You have the power of Time Travel. As a main player, after encounter cards are revealed, you may use this power to call out \"time travel.\" You then return your revealed encounter card to your hand while your opponent sets his or her revealed encounter card aside. If your opponent has no more encounter cards in hand and shows you so, he or she instead returns the revealed encounter card to his or her hand. All other cards played since the start of the planning phase return to their owners' hands. The encounter is then replayed from the start of the planning phase. You both can use any cards in your hands, and this time the outcome is final. When the encounter is over, your opponent takes back the card that was set aside.","player":"Main Player Only","mandatory":false,"phases":["Reveal"],"lore":"Unique among life forms, the Chronos has forever been able to pierce the veil of time and control its own past. Now, the elite of the race grows tired of a world where minor rivalries lead to constant paradoxes and time-quakes and has set out to redesign the Universe. That this involves altering reality comes as past history to the Chronos.","wild":{"description":"At the start of any regroup phase, you may look through the discard pile, choose one card, and add it to your hand. Then, shuffle the discard pile together with the deck to form a new deck. Give this flare to the Chronos after use (or discard it, if the Chronos isn't playing).","player":"As Any Player","phase":"Regroup"},"super_flare":{"description":"When you use your power, you may force your opponent to play the same encounter card a second time. You may change or replay your encounter card.","player":"Main Player Only","phase":"Reveal"},"retooled_gameplay":"FFG wisely added the statement about taking back into hand all other cards played during the initial run of the encounter, which clarifies what happens with kickers. Eon's Wild Chronos was completely different: it simply caused a new destiny to be drawn (this was slightly retooled to become FFG's Wild Dictator). Eon's Super Chronos was completely different: it allowed a player one last-ditch encounter to try to win the game instead of another player who had just won.","edits":"Edited to eliminate the implication that Super Chronos forces Chronos to change his encounter card.","tips":null,"classic_flare":null}