{"name":"Observer","expansion":"Base Game","color":"Green","short_desc":"Allies Do Not Go to Warp","game_setup":null,"description":"You have the power to Protect. As an ally, when you should lose ships to the warp, use this power to instead return them to any of your colonies and keep using them.\nAs a main player, when any of your allies should lose ships to the warp, use this power to instead allow your allies to return them to any of their colonies of their choice.","player":"Main Player or Ally Only","mandatory":true,"phases":["Resolution"],"lore":"Seldom interfering in Cosmic affairs, the Observers have been around for millennia, simply watching the other alien races. With their advanced technology and strange abilities, the others were hesitant to draw them into their squabbles. Now, however, it seems that the Observers have decided that the time for action has come at last.","wild":{"description":"As a main player, after alliances are formed, you may allow each player who allied with you to draw one card from the deck.","player":"Main Player Only","phase":"Alliance"},"super_flare":{"description":"As the offense or an ally, when you send ships into the encounter, you may retrieve one ship from the warp to send. This does not allow you to exceed your normal limit of four ships in the encounter.","player":"Offense or Ally Only","phase":"Launch"},"retooled_gameplay":"Chin's Wild Safety was completely different: it forced allies to send their winning ships to the warp in spite of getting their normal rewards (using other ships to gain the colony in the case of offensive winning allies). Chin's Super Safety was completely different: it allowed the player to protect his own ships or those of the main player he is allied with, filling in the \"missing coverage\" from the base power.","edits":"Edited to avoid implying that Observer works outside of the resolution phase, to fix the launch bug and the defensive ally bug, to fix the incorrect prerequisite bar, and to add the missing (Alliance) icon.","tips":null,"classic_flare":null}