{"name":"Sheriff","expansion":"Cosmic Eons","color":"Yellow","short_desc":"Upholds the Law","game_setup":null,"description":"You have the power to Ticket. Once during each player's turn, you may use this power to choose a ticket from your essence card cache and either discard it, or give it to any player who is committing the infraction on that ticket and has the cards or ships needed to pay the fine. That player immediately pays the fine. If the fine is in cards, you select them at random from his or her hand. If the fine is in ships, the player chooses which of his or her ships to lose. The player keeps the ticket faceup.\nAs the fine is being paid, you may use this power to seize it as a gratuity. Add some or all of the cards to your hand instead of discarding them, or retrieve a number of your ships from the warp up to the number fined. Then the player flips the ticket facedown and gains immunity against further tickets while he or she has a facedown ticket.\nWhen all other players have immunity or you have no tickets remaining, all tickets are returned to you.","player":"As Any Player","mandatory":false,"phases":["Start Turn","Regroup","Destiny","Launch","Alliance","Planning","Reveal","Resolution"],"lore":"The Sheriffs recognize that minor offenses left unchecked will lead to chaos. That the swift serving of justice seems to serve their own intergalactic dreams is but a by-product of their vigilance.","wild":{"description":"At the start of any turn, you may play this flare in front of another player as an electronic monitor. That player cannot send more than one ship to the hyperspace gate without your permission. At the end of that turn, that player adds this flare to his or her hand, but cannot play it against you until after it has been played against any other player but you.","player":"As Any Player","phase":"Start Turn"},"super_flare":{"description":"You may ticket or discard twice per turn.","player":"As Any Player","phase":"Any Phase"},"retooled_gameplay":null,"edits":null,"tips":null,"classic_flare":null}