{"name":"Cavalry","expansion":"Cosmic Conflict","color":"Green","short_desc":"Plays Encounter Card as Ally","game_setup":null,"description":"You have the power to Reinforce. As an ally, after encounter cards are selected but before they are revealed, you may use this power to play an attack or negotiate card facedown from your hand off to one side. This second card is not considered your side's encounter card and isn't affected by game effects that target your side's encounter card, such as those of the Oracle or Sorcerer. Reveal your card when encounter cards are revealed. If you reveal your card to be an attack, add it to your side's total. This has no effect if your side's encounter card is a negotiate. If you reveal a negotiate and your side loses the encounter, you receive compensation after your side's main player has received compensation, if applicable. In any case, your card is discarded after use.","player":"Ally Only","mandatory":false,"phases":["Planning"],"lore":"This race of interstellar policemen has gained quite a reputation for keeping peace on the fringes of space. Many diverse aliens have called upon the Cavalry to help suppress outpost revolutions. Now the Cavalry hope to rule the Cosmos by becoming indispensable.","wild":{"description":"As a main player, you may play this flare when your opponent needs a new hand. Cards are drawn one at a time until he or she has the cards needed for the encounter (usually one encounter card). Your opponent draws the balance of the new hand at the end of the encounter.","player":"Main Player Only","phase":"Any Phase"},"super_flare":{"description":"As a main player, before encounter cards are selected, you may choose one player allied with you. After cards are selected, that player must play an encounter card to reinforce you, if able, as though he or she had your alien power.","player":"Main Player Only","phase":"Planning"},"retooled_gameplay":"Mayfair's Cavalry said \"anything that affects the main player's card, such as Chronos, has the same effect on yours.\" The new version rules that the opposite way, wisely avoiding all kinds of existing and future interaction problems. (Chronos is also nicely revised to take care of this situation; Cavalry would return his card to his hand and is free to play it again if he likes, which makes Cav a bit stronger in this specific case than it was under Mayfair.) Also, FFG wisely changed Mayfair's \"your card has no effect\" to \"this [meaning Cavalry's attack card] has no effect,\" thus fixing Mayfair's issue where the main player revealing a Compromise technically made Cavalry's Compromise useless. Mayfair's Wild Cavalry was completely different: it essentially gave Chosen's power to all allies in the encounter. Mayfair's Super Cavalry was considerably weaker, allowing an ally to reinforce Cavalry without requiring it. FFG's version essentially works both ways, since you can always say to your chosen ally \"don't you wish you could use my power to help us?\" and if he says yes, then play your flare.","edits":"Edited to clarify that the ally affected by Super Cavalry must still adhere to the base power's timing.","tips":null,"classic_flare":null}