{"name":"Dictator","expansion":"Base Game","color":"Red","short_desc":"Controls Destiny Deck","game_setup":null,"description":"You have the power to Command. When you are not the offense, before destiny is drawn, use this power to take the destiny deck, look through it, and choose any card from it. That destiny card is played as though the offense had drawn it. On your turn, or any time you are zapped, the remaining destiny cards are shuffled, and one is dealt at random.","player":"Not Offense","mandatory":true,"phases":["Destiny"],"lore":"Grotesque creatures rejected by an old and cultured world, the Dictators pushed and clawed their way to planetary dominion. Relentless in their demands, they turn friend against friend to do their bidding. Recently they have begun to tire of toying with the weak races at home and seek to control the entire Universe.","wild":{"description":"When you are not the offense, after destiny is drawn, you may force the offense to discard the destiny card he or she drew and draw again. Use this flare only once per encounter.","player":"Not Offense","phase":"Destiny"},"super_flare":{"description":"You may use your power as the offense.","player":"Offense Only","phase":"Destiny"},"retooled_gameplay":"Eon's Dictator was optional while FFG's is mandatory; however, this difference is more academic than actual, since the FFG player can simply \"choose\" the top card of the destiny deck, accomplishing the same result as not using his power. Eon's Dictator could simply declare a color to override the destiny disc drawn; FFG's improved design maintains the natural distribution of how often players are attacked and also prepares Dictator to have more flexibility with possible future additions to the destiny deck. This version allows a bit more latitude in the rare situation where a player is not required to encounter the defense in the defense's own system (e.g., Wild Will), whereas Eon's version mandated that the encounter had to take place \"in the system of that color.\" Eon's version also appeared to prevent the player from re-drawing destiny in the event that Dictator commands the player's own color. FFG's Wild Dictator is greatly simplified compared to Eon's, which allowed a player to propose a new destiny color and then required all players to vote. (FFG's Wild Dictator is essentially Eon's Wild Chronos restricted to \"not offense.\")","edits":"Edited for wording consistency.","tips":null,"classic_flare":null}